{"entries":[{"skip_index":true,"title":"404","url":"/404/","tags":[],"body":"Try checking out The Service Innovation Lab’s homepage or reports. Or, contact us if you can’t find what you’re looking for."},{"skip_index":true,"title":"500","url":"/500/","tags":[],"body":"Try checking out The Service Innovation Lab’s homepage or reports. Or, contact us if you can’t find what you’re looking for."},{"title":"","url":"/author/","tags":[],"body":""},{"title":"Contact","url":"/contact/","tags":[],"body":"Physical Address Service Innovation Lab, Level 4, 191 Thorndon Quay, Wellington, New Zealand Transport Info Bus stop 5022 or 5494 Buses: 1,19e, 24, 26, 52, 56, 57, 58, 60e, 83 Parking along Thorndon Quay Let’s work together to improve the user experience of government. To find out more information about our work you can contact us at ServiceInnovationLab@dia.govt.nz. Email Us"},{"title":"Dev Peer Review Workflow","url":"/devPeerReviewWorkflow/","tags":[],"body":"Pull Request Workflow Our code is written by humans. This will remain true until the robotic apocalypse finally occurs. Humans learn. Humans make mistakes. This peer-review based workflow is used by our team to foster a welcoming environment where we all are lifelong learners, and we support each other as a team to do the best we can, which includes not making mistakes. Peer review We do not work alone. All work has at least two developers involved in any changes. Pull Requests Any dev can propose a code change (a PR). Propose the PR on GitHub, as a proposed change to the dev branch. See “Branch Naming” later in this document. A PR description must include what has changed, but also why it needs to change. (a business or user need). One other dev must approve the PR before it can be merged. Approving a PR means you agree the code works as described and meets our quality levels. For most PRs this will require running the code yourself. Mention on the PR if you didn’t. If there is an associated Trello story, or GitHub issue, provide some details and link to it. If there is no associated story, explain why briefly. PR Feedback / Reviews Commenting on a pull request (opens a link to GitHub) As a team, we attempt to give at least one comment/feedback on each PR. This normalises asking questions. It should be unusual for a PR to have zero feedback. Feedback should be something that could be better. “I love this” isn’t enough. Feedback is given in a form of “Have you considered…” or otherwise doesn’t assume the author didn’t already attempt your alternative approach. “Do it this other way” is not feedback. Comments can be “blocking” meaning the author wants a response to their feedback, or they can be a suggestion only, leaving the decision to the PR author. Indicate this using emoji. Elephant :elephant = suggestion only. Adding line comments to a pull request (opens a link to GitHub) As a reviewer, you can approve a PR using the “Approve” option on Github. Request changes to a PR using the “Request changes” option. Quality Code needs to pass code linters (we use codeclimate). Markup generated for webpages must pass accessibility checkers. Merging PR branches need to be “up to date”, and continuous integration via Travis-ci must run and pass before merging. New code must have tests, and minimum code coverage levels need to be met and maintained. Merges into the dev branch need only one approval to merge but give all active team members reasonable chance to review unless the change is trivial. The dev who proposed the PR presses the merge button on a PR once all the above passes & it is approved. That dev is responsible for merging in a way that does not “break the build” or cause unplanned outages. The branch should be deleted automatically (by the always-be-closing bot) after merging. This keeps the repo tidy. Commit Messages Commit messages should describe the reason for the changes being committed, so that anyone viewing the commit can know what has changed and why. Good messages: Updating Travis config to include dependency installation Bad messages: Updating Travis Really bad commit messages: Fixing stuff so it works Please let it work this time Commit Hello Branch Naming Branch naming in a consistent manner is good for keeping things tidy, and add context to any commit messages for commits against the branch. Branch names should be descriptive and their meanings clear. Additionally, branch names can contain / characters, so a good way to keep types of branches separate is to “namespace” them - for example, any branches whose main purpose is to add a new feature to the application should have the prefix “feature”. Branches for fixing bugs should be prefixed with “bugfix”, while a branch for something urgent that is going to go to production asap should be prefixed with “hotfix”. Here are some examples: feature/automated_dishwasher_emptying fix/ui_disabled_for_anon_users hotfix/offline_jobs_errors Continuous Deployment Our code deploys automatically after a git merge into special branches. dev branch deploys to staging. master branch deploys to production."},{"title":"Expertise","url":"/expertise/","tags":[],"body":"Developers Product development using test driven development approaches and open source wherever possible. Dev Peer Review Workflow Service Design We partner with users and experts to identify their needs and find ways to effectively integrate and digitise services that work for them. Emerging Tech Strategies for adopting and leveraging the best of technologies including insights on emerging technology and how to plan for its impact on society and systems. Prototyping and demonstrations with our Virtual Reality Suite. Champion others/ Empowering Innovation We facilitate workshops, partnerships and hands on training to grow your capability to innovate using the design and development approaches we use at the lab."},{"title":"Getting Started","url":"/gettingStarted/","tags":[],"body":"Getting Started NOTE: These steps only apply to people involved with the Lab. For the first time adding content & getting set-up, it will take longer than usual. Create a GitHub account Go to GitHub Click on Sign up (& follow the steps). Note: Choose the Free Subscription. Remember to verify your email address (in order to start using GitHub’s features). Set up two-factor authentication (2FA) For a step-to-step guide on how to set-up 2FA In the upper-right corner of any page, click on your profile photo -> Settings -> Security -> scroll to Two-factor authentication, choose the appropriate method for you (& follow the steps). Click on On the Two-factor authentication page, either click on Set up using an app OR click on Set up using SMS. Download & save your recovery codes in a safe place so that you can recover your account if you lose your 2FA credentials. You’ll then be re-directed to the next page where depending on the authentication method you have chosen you’ll either need to fill in your mobile number (for sms) OR needing to scan the QR code (for app). Either way, once you receive the code after following the steps, enter it in the section (as shown below) & click Enable when done: Contact one of the Service Innovation Lab's repository admins (ie. Brenda or Jacob) & they will add you to the team on github. You’ll receive an invitation by email. Go to your email and accept the invitation. Glossary of GitHub terms used Adding your picture & profile to the team page Adding a Photo Navigate to the Toolkit’s repository. (Open the link in a new tab/window) Scroll down the repository list & click on serviceinnovationlab.github.io. Ensure that you are on the dev branch , then navigate to assets/img/team. Click on assets->img->team. Note: Before adding your picture, you’ll need to have it saved locally on your machine as firstname-lastname (please ensure that your picture is in jpg format). Click on Upload files Note: Currently, the Edge web browser on DIA devices are not able to upload files. Scroll to the bottom of the page. Enter a Commit message (compulsory) briefly saying what you did (eg. Added a profile picture for Jacob). Enter a further extended Description (optional) for your changes. Below that, type in a meaningful name (eg. added-profile-image-jacob) for the branch which you are creating. Note: Branch names should be in lowercase & a hyphen should be used instead of spaces. Click on You should then be re-directed to another page entitled Open a pull request. See Creating a Pull Request (at bottom of page). Creating your Team Profile Navigate back to the Toolkit’s repository. (Open the link in a new tab/window) Ensure that you are on the dev branch, then navigate to _authors. Click on the Create new file button. In the textfield which appears (at top of page beside the file path breadcrumb), type in your name in this format firstname-lastname.md (eg. jacob-ong.md). Note: File names should be in lowercase & a hyphen should be used instead of spaces. Copy the below code & paste it in the textfield in your file (change the details to yours): --- name: jacob-ong first_name: Jacob last_name: Ong full_name: Jacob Ong role: Developer image: \"/assets/img/team/jacob-ong.jpg\" active: true --- Scroll to the bottom of the page. Enter a Commit message (compulsory) saying what you did (eg. Added team profile for Jacob). Enter a further extended Description (optional) for your changes. Below that, type in a meaningful name (eg. adding-team-profile-jacob) for the branch which you are creating. Note: Branch names should be in lowercase & a hyphen should be used instead of spaces. Click on You should then be re-directed to another page entitled Open a pull request. See Creating a Pull Request (at bottom of page). Creating a Pull Request (PR) You’ve added an image/some content. Now you’ll need to create a PR to let the reviewers know that your image/content is ready for review. You should see your commit message & description carried across & appearing in the text fields. Click on & select JacOng17 & gthurstonnz from the list. Note: It is good practice to have at least 2 people to review your PR. Once done, click on the Create pull request (green button). You will then be redirected to the page showing your PR. Your Pull Request (PR) should be “sent” to the reviewers that you have chosen to review (once it’s approved you should see your changes on the Live site). If you navigate away from that page & would later like to track your PR’s status, click on the Pull requests tab & you can find it there. Note: Before your PR can be merged into the main branch, it will have to pass: 1. The automated checks Example of an unsuccessful check: Example of a successful check: 2. The reviewers’ approval. When Steps 1 & 2 have passed, you should see something similar to this: Note: The person creating the PR has the responsibility of: Checking/following-up on the status of the review; Fixing any changes to be made before approval; Note: If you have any changes that you need to fix, you’ll need to Re-request a review from the reviewers (by clicking on the icon highlighted in the red square below) after you have made the changes requested. And clicking on & ensuring that no errors occur (eg. warning message, etc…) Checking if your changes have been deployed Navigate to the Toolkit’s repository. (Open the link in a new tab/window) Scroll down to the README.md section & look for the CircleCi badge. If the build Passed , navigate to the Live site (open link in a new tab/window) & check that your content has been published. If the build Failed , contact either Brenda or Jacob. If something does “break”/error occurs & you’re unsure of how to fix it, contact either Brenda or Jacob & they should be able to help you out. Back to: Creating your Team Profile"},{"title":"Home","url":"/","tags":[],"body":"Welcome toThe Service Innovation Lab Toolkit"},{"skip_index":true,"title":"Reports","url":"/blog/","tags":[],"body":"Testing our Toolkit By Brenda Wallace July 31, 2019 open source tech Continue reading about Testing our Toolkit ACC Better Rules Collaboration report summary By Glen Thurston July 1, 2019 better rules Continue reading about ACC Better Rules Collaboration report summary Rates Rebates (Te Whakamāmā i ngā Reiti) By Glen Thurston , Siobhan McCarthy November 30, 2018 rates rebate Continue reading about Rates Rebates (Te Whakamāmā i ngā Reiti) Exploring the Notice of Sale Process By Glen Thurston , Nadia Webster October 12, 2018 lessons learned Continue reading about Exploring the Notice of Sale Process Transitioning to an Optimistic Futures Workshop - 18 May 2018 By Matthew McCallum August 1, 2018 lessons learned open source Continue reading about Transitioning to an Optimistic Futures Workshop - 18 May 2018 Page 1 of 2 Next 5 posts Arrow rightArrow pointing to the right"},{"title":"Projects","url":"/projects/","tags":[],"body":"Projects Service Innovation Lab Legislation as Code Exploring the benefits of legislation that is both human and machine readable and what it might take to transition. Read more about Legislation as Code Arrow rightArrow pointing to the right Cross Agency Notice of Sale Understand the Notice of Sale process as part of the ‘selling and buying a property’ life event and potential improvements for people and agencies involved. Read more about Notice of Sale Arrow rightArrow pointing to the right Service Innovation Lab Optimistic Futures Speculating how government, public institutions and society could be resilient and prosperous in the future. Read more about Optimistic Futures Arrow rightArrow pointing to the right Department of Internal Affairs Rates Rebate Exploring ways to improve the current Rates Rebate Service provided by local councils and Internal Affairs. Validate how digital channels might create a better service experience and allow for integration of services and proactive entitlements. Read more about Rates Rebate Arrow rightArrow pointing to the right Ministry of Business, Innovation and Employment Renting a Property Research into the relationship dynamics of renting a property and ways they impact the renting experience and can make it better. Read more about Renting a Property Arrow rightArrow pointing to the right Department of Internal Affairs SmartStart SmartStart provides step-by-step information and support to help you access the right services for you and your baby. Read more about SmartStart Arrow rightArrow pointing to the right Cross Agency Victim of Crime Life Event Testing ways to better inform and support victims of crime using digital channels across agencies and non government organisations. Read more about Victim of Crime Life Event Arrow rightArrow pointing to the right Department of Internal Affairs Consent Based Data Sharing Giving people visibility and control over their government data. Read more about Consent Based Data Sharing Arrow rightArrow pointing to the right Monitor iconImprove public facing interfaces Cross Agency Digital Nations Supporting the network of the world’s most advanced digital nations with harnessing digital technology and new ways of working to improve citizens' lives. Read more about Digital Nations Arrow rightArrow pointing to the right Tertiary Education Commission Entering Tertiary Life Event Understanding the many paths into tertiary education and the needs of prospective students to better navigate them. Read more about Entering Tertiary Life Event Arrow rightArrow pointing to the right"},{"title":"Tags","url":"/tags/","tags":[],"body":"Click through to read our posts about the following topics:"},{"title":"Team","url":"/team/","tags":[],"body":"Team Members Getting Started Brenda Wallace Role: Technology Lead Charlotte Hinton Deshan Gamage Felipe Bohorquez-Perry Role: Scrum Master Glen Thurston Role: Design Lead Grant Carpenter Jacob Ong Role: Developer Karyn Brice Mahkaila Jones Role: GovTech Grad Meredith O'Dea Rob Holmes"},{"title":"Tools","url":"/tools/","tags":[],"body":"Tools Service Innovation Lab APIs for Service Innovation We maintain a list at Data.govt.nz of APIs we’ve found useful to our work. www.data.govt.nz about APIs for Service Innovation Service Innovation Lab Component Library Resource of common application components for developers GitHub about Component Library Ministry of Social Development Family Services Directory API Making Family Services Directory provider and service data publicly available through and automatically generated machine discoverable APIs GitHub about Family Services Directory API Service Innovation Lab Open Fisca Aotearoa Resource of machine readable New Zealand legislation coded by the lab and partners GitHub about Open Fisca Aotearoa Service Innovation Lab RapuTure Explore how coded rules from our legislation as code work connect with each other at www.rules.nz GitHub about RapuTure"},{"title":"open source","url":"/tags/open-source/","tags":[],"body":""},{"title":"lessons learned","url":"/tags/lessons-learned/","tags":[],"body":""},{"title":"rates rebate","url":"/tags/rates-rebate/","tags":[],"body":""},{"title":"better rules","url":"/tags/better-rules/","tags":[],"body":""},{"title":"tech","url":"/tags/tech/","tags":[],"body":""},{"title":"","url":"/projects/consent-based-sharing/","tags":[],"body":""},{"title":"","url":"/projects/digital-nations/","tags":[],"body":""},{"title":"","url":"/projects/entering-tertiary-life-event/","tags":[],"body":""},{"title":"","url":"/projects/legislation-as-code/","tags":[],"body":""},{"title":"","url":"/projects/notice-of-sale/","tags":[],"body":""},{"title":"","url":"/projects/optimistic-futures/","tags":[],"body":""},{"title":"","url":"/projects/rates-rebate/","tags":[],"body":""},{"title":"","url":"/projects/renting-a-property/","tags":[],"body":""},{"title":"","url":"/projects/smartStart/","tags":[],"body":""},{"title":"","url":"/projects/victim-of-crime-life-event/","tags":[],"body":""},{"skip_index":true,"title":"Search results","url":"/search/","tags":[],"body":""},{"skip_index":true,"title":"Reports","url":"/blog/page/2/","tags":[],"body":"The Service Innovation Lab 2017-18 FY Work Program Report By Pia Andrews July 1, 2018 open source Continue reading about The Service Innovation Lab 2017-18 FY Work Program Report Aotearoa New Zealand Government Innovation Assets and Risks By Matti Schneider June 1, 2018 open source Continue reading about Aotearoa New Zealand Government Innovation Assets and Risks Arrow leftArrow pointing to the left Previous 5 posts Page 2 of 2"},{"title":"Aotearoa New Zealand Government Innovation Assets and Risks","url":"/2018/06/01/aotearoa-new-zealand-government-innovation-assets-risks-matti-schneider/","tags":["open source"],"body":"as seen by a nomadic public service innovator in 2018 This report can also be downloaded as a PDF file. The Lab The Government Service Innovation Lab of Aotearoa New Zealand, hosted by the Department of Internal Affairs, is one of these “makers” pockets that found a way in government and bring within it an ability to do disruptive innovation. These are not to be confused with other administration modernisation and innovation departments that focus on optimising internal processes. These more recent initiatives indeed leverage one specific way of modernising: they focus on the interactions between citizens and the administration. They aim at delivering high-grade, user-centred public digital services, in the open, within strong resources constraints. While counterintuitive at first, other countries have demonstrated the efficiency of this practice, and now recognise delivering services as the best strategy to improve agencies processes, driven by actual usage. The main similar initiatives around the world1 are gov.uk (UK, GDS2, 20113), 18F (US, GSA, 2014), beta.gouv.fr (France, DINSIC, 2015) and Team Digitale (Italy, AgiD, 2016). Assets Team As for all of these other international examples, the primary asset of the Lab (if not its entirety) is a very motivated, talented, interdisciplinary and genuine team with a bold and visionary leader. The central role of such servant leaders is to empower their colleagues by acting as a “brick umbrella,” protecting them as much as possible from whatever the layers of bureaucracy above throw at them, allowing the positive and rewarding environment in which resilient and adaptable teams thrive. Such units leverage best engineering practices (continuous integration, continuous delivery, cloud hosting…) to ensure reliability and quality despite very constrained resources. Lab meeting, DIA, Wellington, 2018 Capability The Lab team has secured these elements for a few months and is now equipped with excellent delivery examples such as the Rates Rebate or SmartStart apps. These elements will build the mana of that team across and beyond agencies, giving it more ability to engage partners, in turn offering more delivery opportunities, in a self-reinforcing loop. The primary value proposition of Lab-like initiatives is an ability to deliver, thus demonstrating it is crucial to both growth and sustainability, and this one is well on its way. Risks Low leverage Even while demonstrating its value, I believe that the Lab is currently too far away from central power to have a strong impact. All other successful examples I found, including all the ones cited earlier, are at most at tier 3 from Prime Minister or equivalent authority. Innovation is about taking risk. By definition of bureaucracy, layers of hierarchy are there to mitigate risk. Even with the best umbrella, it is impossible to do visible, engaging disruptive innovation under mattresses. The first reason is that of the sheer amount of advocacy work that needs to be done by a team with already limited resources. The second is because a successfully delivered digital public service does not have the same inspirational impact on other agencies if it is “that DIA department” that did it or if it is “the GDS Ministerial Lab.” Status is an influential —and sometimes mandatory— element to diffuse innovation in a bureaucracy and engage non-cooperative actors. Under-resourcing The Lab will be unable to scale as such. It already operates over capacity, and funding uncertainty prevents investment. Since its team is made of people used to work within strong constraints, the risk is not so much of disrupting current operations or of limiting delivery ability; the actual risk is of burning out the team. Beyond the human impact, that would also mean a wasted investment: people who are competent in both their skills and government ways take a long time to grow. It is worth noting, however, that it is a recurrent pattern for these very innovative teams to be at first ignored —or even mistreated— by their host agency until their value is impossible to deny. All of these now “famous” labs have their own horror stories of uncertainty and defensive struggles. I explain this by metrics mismatch: since they bring disruptive innovation abilities within government, the bureaucracy is not equipped to measure their effort and impact: there is no massive budget, no 100-pager to read in the cabinet, no 3-year outsourcing contract that are the usual signs of “big things.” Working software as the primary measure of progress, while indisputable for agile practitioners, is invisible for the administration until the value brought is too visible to deny that the problem is in measuring impact, not in having it. The temporary Lab office after earthquake-prone offices had to be evacuated, DIA, Wellington, 2018 I recommend focusing on delivery as the primary strategy, as funding will either be cut entirely at some point or finally recognised as the necessary fuel for a new way to deliver public digital services, and that second option can only happen by demonstrating how cost-effective that way can be by operating in the current constraints. Scope creep A recurrent temptation for makers who face administrative friction when changing one agency’s processes is to take up another challenge while waiting for the slower-paced political plays to unfold. Avoiding this is not possible nor desirable, as it is a sign of the entrepreneurial mindset that is precisely sought in such initiatives, and often yields unforeseen benefits4. However, the risk is to then expand the team’s responsibility to maintain or keep exploring too far, putting an even stronger strain on limited resources. The current Lab scope seems too broad to be sustainable regarding both resources and organisational readability. Trying to be present at the same time in delivery, future tech (AR/VR) exploration, system-wide strategy, citizen engagement…, while useful to identify political boundaries and strengths considering its young age, will not scale. Leaders that can engage makers must be visionary, which means that they sometimes can think too far ahead and overlook the burden of maintenance, prioritising investment over working budget. However, switching back to a managerial, accountant mindset is not the appropriate answer as it would very quickly disengage the team. I recommend to raise awareness of available resources, actual political engagements and associated funding streams, and to encourage and empower the team to take responsibility for their load from this information. Such a practice can limit scope creep while yielding the most innovation and fostering productivity. Aotearoa New Zealand government innovation landscape The Lab operates in a broader government innovation ecosystem. Beyond organisations, this section also takes an anthropological lens to characterise the inherent strengths and weaknesses of the cultural environment in which agencies operate. Principal Assets The principal assets I have identified for Aotearoa New Zealand to innovate in government lie in its ability to go beyond silo mentality by sharing vision and resources both across executive-operational layers and across the public, private and community sectors. Nimble government Even though civil servants might not all feel action is fast enough, I have consistently observed a relatively short, 2 to 3 weeks time from first exposure to first action towards implementation of a new idea, practice or tool. Delays of two months are common in continental France and can be even longer in overseas territories. Frictionless operational communication I have observed a distinctive kiwi positive communication style, with people genuinely reinforcing each other’s worth and value brought to a project. This could merely be a different way of expressing judgement5, but I attribute to this style an ability to engage on an operational level with less effort. With less risk of being shunned, agents from lower tiers feel more confident in joining a conversation. Similarly, Aotearoa New Zealand has the lowest professional gender bias of all countries I have observed. Since diverse operational insights are one of the basic needs for system innovation, this ability to engage is a definite asset. Bigger bureaucracies tend to make it mandatory to inaugurate discussions through higher tiers, or even to prevent them until they establish a formal working group. Such a silo and layered mentality prevents serendipity and thus innovation. “All-of-government” All-of-government gives the conceptual, sourcing and partly practical basis for collaboration across agencies. Even with no extensive use of all-of-government contracts, the simple use of the term “all-of-government” as a shared notion makes it very simple for agents to state when they are willing to work beyond their agency’s boundaries and to quickly assess if their counterparts are as well. In most countries, these practices have to be first established through peer-to-peer agreements, increasing the time to first meaningful collaboration. Digital 7 operational relationships The network of (self-proclaimed) “most advanced digital nations” D5, now expanded to D7, provides an excellent venue for sharing experience. Considering the natural duplicability of software and the commitment of these nations to work open-source, participation yields an extremely cost-effective way to reuse digital components and good practices. Sharing stories of successes and failures also brings new ideas and can prevent mistakes from being repeated. Aotearoa New Zealand is culturally ideally positioned to benefit from such exchanges: it speaks the global English language, which ensures it masters communication and can access most information; yet it comes with a multicultural and multilingual understanding perspective thanks to its Maōri component, which helps it avoid falling into the trap of underestimating cultural relativity. The USA in contrast, speaking only English, have access to as much information but have a tendency to dismiss other nations’ experience at the first sign of cultural mismatch rather than listening to the whole story and then extracting the pieces that make sense in their context. Concerned network of private actors With an understanding of the reputation of Aotearoa New Zealand as a clean, safe and socially conscious country as a shared asset, most private actors6 are more aligned with government objectives than in countries where the distribution of responsibilities simplistically opposes a right to regulate against a right to act until regulated. Community-conscious initiatives thrive and can quickly become partners of central and local government. As co-design is a crucial part of user-centred innovation and peer-to-peer diffusion an ingredient of adoption, this ease to work across legal entities is a strong asset. Innovation agencies operating in countries where the administration is considered as corrupt or as an enemy spend a significant part of their resources compensating for reputation deficit when engaging with private actors and individuals. Quest for clarity All stakeholders of an action, be it standard service delivery or significant process change, seem to look for a clear understanding of why they are engaging in an activity. Artefacts (posters, flyers…) stating and reinforcing end goal visions are omnipresent, and ceremonies (team meetings…) are used to that effect as well. Since radical innovation, by profoundly changing processes, can only pay off with alignment across layers, the familiar presence of tools and practices for diffusing vision is a definite asset. In countries that take a top-down approach to action, operational agents training to follow a process rather than being engaged in it hinder change initiatives. The Lab front door, Wellington, 2018 Main Risks The main risks I have identified that can hinder government innovation lie in missing the tools to challenge the status quo. Consensus over action Innovation is all about questioning ingrained habits and processes, and while its construction should be collaborative, its impact will by definition change the way stakeholders work. The flip side of positive communication is that it can be hard to distinguish clearly between enthusiasm to participate and actual commitment or to go through productive conflicts, which can then limit the ability to act on known problems. Waiting for all actors to be fully aligned with a vision prevents experimentation from happening, while the result of said experimentation would often be the most effective demonstration. Any strategy is only worth as much as the ability to deliver upon it. In the UK, the strategy was very clearly stated: “digital by default” and “assisted digital” make for such strong directions that they are now the Digital Service Standard. But only by following “the strategy is delivery” could these have any actual impact. Funding instruments and ambition mismatch If the ambition for innovation in government is to have public digital services delivered in an agile, user-centred and experimentation-based fashion, then competitive funding is counter-productive. Innovative products are best produced within short timeframes by small teams of people who typically don’t have a lot of capacity or interest for long descriptions and plans —which is why they are the best fit for “de-bureaucratising” processes on behalf of end users in the first place. This fact implies that public innovation is best funded by small grants given to agencies with concrete use cases and strong teams. To ensure doing gets an advantage over planning, application to these funds should have an aggressive, unusual format that aligns with the expected result. In the USA, 18F engages very early, by email, and expects the problem to be defined collaboratively. In France, the State Startups Incubator only works with agencies that have identified a civil servant intrapreneur providing a one-page product description7. Underrating of public digital infrastructure Offering capability to the economic and community components of society does not mean having an empty government. On the contrary, stable infrastructure yields more benefits to all. If Aotearoa New Zealand is to position itself as an “information society,” it is critical that it recognises the need for the digital infrastructure that will enable this. Just like sewage and roads are critical water and transport systems that allow healthy communities and strong economic actors, a knowledge-work society needs strong, maintained and up-to-date pipes and hygiene. This starts by ensuring agencies consider software as an asset, not a liability. And continues by providing a robust and secure network of connectivity and hosting providers, which can be public or private, but that should all be within New Zealand sovereignty area. This notion of public digital infrastructure should also extend to data. France has for example pioneered the notion of “public data service,” identifying nine datasets as being critical for agencies and companies alike, and enshrining their availability and quality in legislation. A long-standing piece of infrastructure: the railway station, Wellington, 2018 ICT strategy recommendations This set of recommendations builds upon the previous observations, as well as on my reading of strategy documents, participation in an ICT strategy co-design session, and interviews with participants before and after it. It aims at complementing and influencing the current directions, not replacing them. Focus on capability An important area of focus for the current ICT strategy is rephrasing elements that were already discussed under the previous government. While political alignment is a manifest necessity for public action, a strategy that aims at enabling delivery and transformation should affirm focus on impact and capability mapping to embody the priority given to investment and action. The time for government as a platform is now Actually, it was yesterday. Platform economics are already ruling the world of knowledge work. New relationships have to be built between government, economy, and society. Every day that passes where the government keeps policing through only regulation and strategies rather than building enabling platforms is more power flowing away to the GAFAMs and a lost opportunity to the people of Aotearoa New Zealand. Parliament House with national flags, Wellington, 2018 Such platforms should provide agencies, companies and individuals alike with APIs to interact with public services, interconnecting society components and providing governments with soft yet immediate and measurable power by regulating these platforms. Fund public innovation Create innovation funding instruments that allow other agencies to replicate the Lab’s achievements: small grants, small descriptions, small durations, big ambitions. And then shine the spotlight on these other agencies’ realisations. Larger-scale transformation funding would then be most effectively provided to agencies that have already demonstrated an ability to deliver smaller-scale services. Without implying that the exact same practices can be applied on any problem, there is a definite risk limitation in knowing that agents have first-hand experience with lightweight methods and fast delivery when tasked with updating large systems and processes. The Lab is one piece of the puzzle Use it to spearhead, demonstrate, engage, hire. The Lab will never deliver all public digital services, nor should it aim to. But it can be used to show what all agencies should try to emulate. Make it grow and evolve similar initiatives across central and local government, by getting Lab alumni to mentor them. Use the Lab reputation and skills to hire highly skilled digital professionals, and trust the Lab to facilitate their onboarding: it is the only part of government that speaks their language. Better Rules hackathon final presentations, Wellington, 2018 This document is licensed under Creative Commons Non-derivatives 4.0. You are free to redistribute and share it as long as you attribute it to “Matti Schneider for the New Zealand Government’s Service Innovation Team” and do not alter its contents. I do not include state-wide digital initiatives in countries such as Estonia or Singapore. Indeed, while yielding a very capable digital government, these do not face the same challenges of transforming an existing massive system, and thus have very different adoption and political strategies. ↩ Expanded acronyms of host agencies are: Government Digital Service for gov.uk, General Services Administration for 18F, Inter-ministerial Direction of Digital and IT Systems for beta.gouv.fr, and Agency for Digital Italy for Team Digitale. ↩ Dates are official opening years. In most cases, under-the-radar pilot cases had taken place in the preceding months. ↩ The French api.gouv.fr portal, the Agencies Directory API and verif.site all started as small prototypes made under 2 days by “bored” yet empowered members of beta.gouv.fr. This also illustrates why innovation needs operational engagement. ↩ For example, by giving negative feedback through the absence of positive feedback. ↩ “Private actors” as opposed to public actors, not considering whether they are for profit or not. ↩ All these descriptions are publicly available. See for example the one for Now!, a State Startup from the unemployment agency. ↩"},{"title":"The Service Innovation Lab 2017-18 FY Work Program Report","url":"/2018/07/01/Lab-Report/","tags":["open source"],"body":"30 June 2018 by Pia Andrews - Service Innovation Lab Lead The Service Innovation Lab is a venue and capability delivery engine for the Service Innovation Work Programme. The Lab work is overseen by a cross agendy governance group, the Service Innovation Working Group with support from the Service Innovation Reference Group (which enables operational collaboration and leadership. Please also find an accessible mindmap of Lab deliverables and the draft Lab Lean Canvas. Exec Summary This is the final report for the 2017-18 financial year. All deliverables were completed as per the summary in this report. The team also explored the unique value proposition of the Service Innovation Lab which will help inform the cross agency governance bodies on what is best done through the Lab. We also explored emerging technologies and trends and their implications for government, we worked to always collaborate and enable greater innovation throughout the public service in the course of our work, and we explored system barriers and opportunities for genuine digital transformation of the NZ public sector. The Service Innovation Lab, working with agencies and partners across New Zealand, has certainly punched above its weight, and provides a good example of how genuine collaboration around shared goals can drive better outcomes for everyone. In June 2018, the Service Innovation Working Group (SIWG, the SI Lab funding and oversight governance body) approved to increase support for the Service Innovation Work Programme (including work done in and with the Lab) for work program initiatives agreed by the Service Innovation Reference Group (SIRG). This vote of confidence, especially in the absence of a mandate or requirement for agencies to fund the work program, speaks volumes about the confidence generated in the Service Innovation Lab and work program as a means for agencies to accelerate the design and delivery of better services for the people of New Zealand Aotearoa. The Service Innovation Lab is a credit to the Service Innovation Reference and Working Groups (our cross agency governance groups), the agency teams & partners who came together with the Lab around life events & proactive entitlements, and the dedicated Service Innovation team who have worked to deliver and support both an environment conducive to genuine collaboration, and a highly skilled workforce to support service innovation. Accomplishments The SIWG/SIRG endorsed work program deliverables - final report These were all the SIRG/SIWG agreed deliverables from the 12 months work program with status and links where relevant. Deliverables from July 2017 to 31 Dec 2017 Initiative Deliverable Services Register 1.0 (Family Services Directory based reusable component, initially for SmartStart use) Status: Complete. It was clear from early work in the Lab that a services register was a necessary reusable component for integrating information about services across different agencies for users. The first iteration for this reusable compoent was based on the user needs of SmartStart users to identify relevant family services near them. We worked with MSD to make the Family Services Directory fit for purpose for service delivery and available as an openly available API, courtesy of data.govt.nz. Links: The FSD reusable component, technical information and the reusable Directory Search Interface. Entering Tertiary Discovery (TEC) Status: Complete. This was such a broad potential scope that the Discovery turned into a Pre-Discovery to identify specific opportunities for service improvements and delivery for the myriad user needs identified in the process. It was a collaborative process involving the tertiary sector through TEC engagement, and helps inform the TEC work program. Links: Early blog post on the Pre-Discovery findings, an earlier “Better Choices” Design Sprint which helped inform the Pre-Discovery. The final report is published on the TEC website as a formal publication. API security model guidance Status: Complete and handed over to Government Enterprise Architecture group at GCDO (DIA). The Lab worked closely with the Government Enterprise Architect group in DIA to engage with API experts across government and the private sector on new guidance for consideration in the New Zealand API Guidance on ict.govt.nz. We tested the API guidance already in place, explored the needs of users, developers and agencies, we considered emerging trends and risks from non human actors (AI, software, machine to machine interactions) and handed the guidance over to GEANZ. We also ran an emerging technology showcase on APIs for service delivery to explore some of the considerations for agencies. Links: Exploring API Security, Emerging Tech: APIs for service delivery Rates Rebates Discovery Status: Complete. One of the opportunities identified from early \"Becoming a Senior\" life journey mapping that could immediately improve many people's interaction with government was a more proactively delivered Rates Rebate entitlement. This is a rates subsidy for low to middle income rate payers and a real pain for end users, for Councils and for Central Government. The Discovery drew on existing research and conducted new user research and a service design led approach to the entitlement both to solve this pain point, but also to explore the pattern of how government makes such entitlements more proactive. Links: The Rates Rebates Discovery Report, all Rates Rebates blog posts (see Alpha links in the 30 June deliverables list below). Digital ID transition early prototyping Status: Complete. The Lab team provided early support to the Digital Identity Transition team in exploring user and agency needs, including technical input and wireframing of concepts to test with users. Link: None, as was not able to be published at the time. Future work will be published. Service Innovation Toolkit 2.0 Status: Complete and continually improved. The first iteration of the Service Innovation Toolkit included useful guidance about Agile and Service Design methodologies which were included on the WebToolkit (now migrated to digital.govt.nz). We looked at the needs of service design and delivery teams and realised the teams needed 3 fundamental functions: 1) information and guidance (best practice, case studies, links, tools, up to date information on emerging trends, etc); 2) resource sharing (reports, user research, code and asset sharing, common patterns, etc); 3) collaboration (lists of communities of practice, means to collaborate, peer support and engagement). We also identified 4) access to sandpit tools would be greatly helpful to teams to reduce startup costs. We focused the first stage on the information/guidance needs and used a wiki to continually draw together information organically both to support teams, but also to provide a means of collaborating on service innovation. This pre-dated digital.govt.nz and will be revisited in the next financial year. Link: The Toolkit 2.0 (information sharing) is at http://serviceinnovationtoolkit.wikidot.com/ as a temporary collaboration tool. Service Analytics POC Design (user needs analysis) Status: Complete. Cross channel and possibly cross agency service analytics were identified as a high value evidence base to inform service design and delivery, to measure impact of new, changed or retired digital services, and to understand the user journey across channels and domains. This deliverable was to consult with agencies, learn their user needs around service analytics, design a basic POC and prioritise based on the agency needs. Link: The problem definition and early user needs report is here (2017), the POC report is here (2018). Emerging tech workshops (ongoing) Status: Complete and ongoing. We identified a need for service design and delivery teams to keep up with emerging tech and trends. We tried running an “Emerging Tech Showcase” which was heavily oversubscribed so have run these events every month or two, each focused on current tech and trends of interest. We have had over 600 attendees over the past 8 months. Links: The first Emerging Tech workshop with guests from the US & UK, all additional Emerging Tech showcase events linked here and includes AI, VR/AR/MR, APIs, measurement and other topics. Victim of Crime Life Event support (continued to 30 June 2018) Status: Complete. This Discovery work was led by Police with support from the Lab. Early discovery led to prototyping ways to better inform victims of support services, but due to complexity of the support services landscape across different entities, this work was pivoted in early 2018. Other options to support victims were explored with the stewardship group deciding to not progress at this stage. This is a good example of ensuring user needs and user value is prioritised over expediency, and all discovery work has been adopted by Police and other entities involved to help inform and improve a range of victim support services. Link: A final report is being prepared, however some blog posts are available with content about discovery insights and user needs. The work has continued to inform ongoing service design and delivery work across Police and their partners Public Facing Business Rules for SmartStart related entitlements (entitlements engine/legislation as code reusable component) Status: Complete after rolling over to June 30 deliverables. Another high value user need identified for SmartStart was the ability for people to more easily explore eligibility for services across agencies relevant to having a child. The Lab worked closely with the SmartStart team and their contractor as well as with IRD and MSD to deliver an Alpha “Financial Help” function on SmartStart, an indicative eligibility engine, on the back of a first iteration “legislation as code” reusable component. The rules were codified in a way that can be reused by other life events, and we explored multiple methods for encoding eligibility and calculation rules through APIs as a reusable component. This also inspired the Better Rules discovery sprint in January 2018 with IRD, MBIE, PCO and others. Links: The Financial Help functionality on SmartStart, the first iteration Eligibility Engine (based on the Australian Regulation as a Platform tool), the second iteration Eligibility Engine (based on OpenFisca, a French Government tool), and finally this work led to doing a cross agency Better Rules Discovery Report which explored legislation as code and codesign of policy/legislation for better public services. Common Delegations – options for End of Life & make previous work reusable Status: Complete. The earlier “Common/Central Delegations” prototype work conducted by DIA was reviewed and published publicly. It was found to be unfit for a reusable component in the existing state for several reasons: 1) it was too specifically tied to RealMe (an extension), 2) the functionality tried to serve all possible scenarios without actively being applied to any single use case, 3) it was too complex for existing life event requirements, 4) it is a relatively heavy Java application, which doesn’t easily sit alongside more modern web based development languages used by the life events to date, and 5) it was tied to the ForgeRock software stack, making it difficult for any other IAM to integrate. The software and final report were published with some clean up on the Service Innovation Lab github for future considerations, and the End of Life functionality requirements were met by their vendor in a much more lightweight way appropriate to user needs. Next steps is to assess delegations needs as they arise in life events/proactive entitlements work and start with extendable MVP. Links: Common Delegations Project Closure Report (Datacom), a Central Delegations Service prototype (Datacom), Using Wildfly Swarm Java EE microservice (Datacom). Consent based information sharing (publish generic data model and build MVP) Status: Complete. The “Consent based information sharing” project and MVP was moved from DIA back to MBIE where it has been rebranded “Business Connect”. The work done whilst at DIA continues to inform work around consent based information sharing when it arises as a functional requirement for life events and proactive entitlements however, we have also started exploring “verifiable claims” as an alternative to sharing personal data where a condition can be confirmed by a authoritative agency, negating the need for sharing or processing (such as a means test from IRD, or confirmation of age eligibility from DIA). We were able to publish the early draft “Generic Data Model” for consideration in our work and other service delivery teams. Links: The Common Data Model and the AoG Data model is here Deliverables from January to 30 June 2018 Initiative Deliverable Life events 1. ‘Entering Tertiary’ Alpha (TEC) - pivoted to Community Sservice Card (CSC) MVP Status: Complete. In consultation with TEC we pivoted to a CSC MVP based on previous user research work. TEC were not ready to proceed to an Alpha as originally planned and so candidates across the SIRG prioritised life events and proactive entitlements were considered by the Lab team as to viability with regards existing resources and research, value to users and prioritisation according to SIRG. We developed a working rough Alpha for Community Services Card (as opposed to a polished Alpha like in Rates Rebates) as a prototype to explore concepts from the earlier Discovery Sprint from Creative HQ and to test with agencies and potentially users, taking into account the pain points identified by relevant agencies in various meetings over the last 12 months. Next steps would be to work with agencies to iterate, test and explore possibilities in this space. Links: The MVP CSC demonstrator is available here. It is a mobile responsive tool based on the user need that people largely don’t know the value of getting a CSC. The MVP needs to be tested with users, agencies and to be included in a more formal discovery/alpha in collaboration with relevant agencies. The MVP is only a strawman to start discussions. Life events 2. Renting a Property Discovery (MBIE) Status: Completed. The Renting a Property Pre-Discovery work identified 9 distinct opportunities to improve the experience of tenants and landlords with better quality homes. It led to the design and development work starting to create an Alpha in the 2018-19 financial year. The team produced excellent outputs and the stakeholder engagement has been broad and effective. The team did user research in Auckland, Porirua and Whanganui. One participant from the Housing Commission commented that the 5 weeks work yielded greater insights and research than an entire year of someone preparing a thesis. It is the first life event discovery where we have explicitly tried to also map against the Intergenerational Wellness Framework which may be of interest to other agencies. The opportunities identified and concepts tested with end users (tenants, landlords, advocates and more) form a strong basis for moving into at least one Alpha in the next financial year. Links: links to come. Life events 3. Moving to NZ Discovery (INZ) - pivoted to Citizenship Status: Completed. The Lab ran a scoping session for INZ that resulted in internal initiatives being linked up around life event for INZ to focus on but they did not wish to proceed to a Discovery at that stage. The Discovery resourcing was then pivoted to Citizenship given the close relationship to the life event. The Citizenship team had already done a lot of process mapping and solution identification when they started with the Lab, The Discovery resourcing was used to focus on user journey research, pain points for agencies, and testing/validation of a solution proposed by DIA Citizenship service team. Alternative future modes of service delivery were also explored. Options for an Alpha were explored in preparation for the new financial year and an Alpha is planned for the new financial year. Links: No links, work is sitting with DIA Citizenship team. Life events 4. One other Pre-discovery and/or Discovery for a life event Status: Completed. The Lab team had a few candidates for this work and are finalising some scoping and pre-discovery work for both the proactive entitlement of immunisations with the Ministry of Health, as well as the proactive sharing of high risk offenders information from Corrections for staff safety across agencies. The more promising of the two will proceed to a full Discovery or Alpha (depending on availability of pre-existing user research and other planning) in the new financial year. Links: Reports are sitting with relevant departments for consideration of next steps. Proactive Entitlements 1. Rates Rebate Alpha. Status: Completed. The Rates Rebates Discovery led to a collaborative Alpha pilot with Tauranga City Council, with some interest, contributions and participation from Auckland, Wellington and other Councils. The first round of Alpha testing was well received by users with an up front eligibility test prior to applying, and then a streamlined application process which is almost entirely digital, as enabled by new legal advice regarding digital signatures from the Contract and Commercial Law Act 2017. The Alpha was extended to test with a larger group of users till 30 September. Full Alpha Report to be published shortly thereafter. Links: Alpha Report to come, the Rates Rebates Alpha is available online here (until 30 Sept), all blog posts with previous research available here, and a blog about overcoming legislative barriers and our use of a digital signature is here. Proactive Entitlements 2. Support/Scoping for School and Startup Payments, Health entitlements and Paid Parental Leave Status: Complete. The SmartStart team have largely looked into this through their work, and the Lab team have provided some support, particularly around business rules of PPL, Best Start and other relevant entitlements. The Lab will have completed a some initial work on Immunisations which also feeds into this deliverable. Links: No relevant links, mostly a supporting role for this deliverable. Common components 1. Services Register extension Status: Complete. The first iteration of the Services Register done in 2017-18 Q2 provided the necessary functionality for the SmartStart “Services Near Me”. The extension work completed in Q3-4 included the development of a generic search interface as a reusable component, with first use cases including and MSD mobile app, govt.nz, Citizen Advice Bureau and Community Services Card. There was also some preliminary work looking at SuperGold Card as a next extension and identification of other service registers which could be included such as the HealthDirect catalogue. The generic search interface has been repurposed for two other initiatives thus far, namely a CSC rough alpha and Red Hat have taken it to use. Govt.nz are considering implementation of the search function for public use, and MSD are considering SuperGold as a next candidate for making the data available as a reusable component. Links: Family Services Directory Mobile demonstrator Emerging tech workshops (ongoing) Status: Complete and ongoing. We identified a need for service design and delivery teams to keep up with emerging tech and trends. We tried running an “Emerging Tech Showcase” which was heavily oversubscribed so have run these events every month or two, each focused on current tech and trends of interest. We have had over 600 attendees over the past 8 months. Links: The first Emerging Tech workshop with guests from the US & UK, all additional Emerging Tech showcase events linked here and includes AI, VR/AR/MR, APIs, measurement and other topics. Common components 2. Entitlement Rules/Legislation as Code reusable component Status: Complete to a functional MVP/Alpha phase. The entitlement rules required for a “Financial Help” function on SmartStart as well as eligibility for relevant services on any life event was completed with 18 initial entitlements and tax credits from MSD and IRD, with strong collaboration from both agency and approval on the approach, so long as it was caveated as an indicative eligibility engine, not authoritative or specific in terms of exact calculation. This was done and has been very successful. The initial rules engine was replaced by OpenFisca, A French Government tool for financial benefits and taxation eligibility, calculation and obligations modelling, and Best Start was also added along with updated for the 1st July changes that needed to be incorporated into SmartStart (with strong collaboration between the Lab, the SmartStart team and their vendor). The idea of computational rules of government led to the short 3 week Better Rules Discovery Sprint, a collaboration between IRD, MBIE, PCO, the Lab and an independent developer, which has been lauded as world leading and the basis for further work in New Zealand and with the D7. The rules engine was also used in a Hackathon for TechWeek with teams from private and public sectors participating in an exploration of legislation as code with results available at https://legalhackers.nz/betterruleshack/. Links: Financial Help on SmartStart, the 3 week Better Rules Discovery Sprint, and documentation about the reusable component. Common components 3. Streamlined application or notifications service Status: Complete. The Rates Rebates Alpha is a streamlined application service, built to be reusable for other application services. The team will be also further exploring notifications with upcoming life events. Links: The Rates Rebates Alpha is live till end of September and code available on github here. Common components 4. Common delegations or notifications service Status: Complete. See notes on Common Delegations from 31 December list above. Links: Common Delegations Project Closure Report (Datacom), a Central Delegations Service prototype (Datacom), and Using Wildfly Swarm Java EE microservice (Datacom). Reusable Components 5. Reusable code created from SmartStart Status: Complete. Previous SmartStart components were open sourced including a RealMe integration component and various reusable parts of the platform, some of which were reused in other Alpha work above making for faster more efficient development, ready for for reuse by other agencies and life events. Links: SmartStart has a frontend in reactjs, and a backend in django hosted on Catalyst’s cloud. There is also a Django app for integrating the RealMe authentication service. It was used for the SmartStart integrated services and is likely to be useful to many people integrating with Realme. There is also an analysis of SmartStart as a federated service. With thanks to Catalyst IT. Additional: Service Analytics POC - moving from design into a working Proof of Concept Status: Complete. A small POC to explore the viability of integrating service analytics across channels was explored in DIA (given the ready access to analytics data) using Citizenship and Marriage as two examples of life events for the purpose of exploration. The POC went well and the final report with screenshots and details is linked below. The results were very promising. Links: The problem definition and early user needs report is here (2017), the POC report is here (2018). Additional accomplishments Above and beyond the work delivered above, the Lab has had the following highlights and accomplishments. The Lab has been visited by subsequent Ministers of different governments in the 12 months of operation, demonstrating a high level of political interest and support of the work. Minister Clare Curran has explicitly named the Service Innovation Lab as her favourite example of GovTech in New Zealand. We hosted two booths at the D7 Showcase Event at the Beehive, one about life event services, and one with a 50 year future vision “optimistic future” presented in a virtual reality experience for the Minister & various senior officials from New Zealand and around the world. This was followed by a showcase at MBIE with two stands which were well populated by over 350 attendees. Tauranga City Council wrote to the DCE for Local Government at DIA, Ms Helen Wynn, praising the Rates Rebates work by the Lab and asking whether DIA will make it a national service. Auckland, Wellington, Ashburton and other Councils are also keen to get involved, and the relationships and trust built up now provide much greater opportunity for productive collaboration with Councils across the country. The Lab team facilitated a “National Age Friendly Communities” workshop for the Office of Seniors (MSD), generating ten agreed opportunities to improve the lives of senior citizens in New Zealand, and generation greater interest to work on the life event in the Lab. The “Better Rules” work done in collaboration with IRD, MBIE, PCO and a private sector company to explore the digital transformation of legislation and policy (including machine readable legislation as code) has generated extraordinary interest and support across the New Zealand Government, Councils, the Digital 7 nations, Law Foundation, World Bank and many others. It led to the development of a Legislation as Code reusable component in the Lab (currently being used for three life event services and Alphas). The work is widely considered world leading and a significant opportunity for true digital transformation. The MBIE Better for Business team want to co-lead some work with the Lab around the opportunities, including the establishment of an informal cross sector user group to support and share insights across the research, policy/legislative and implementation work streams being driven by different entities across New Zealand, and a cross jurisdiction demonstrator is considered a priority by the D7 to explore how legislation/rules as code could improve international user experiences. The team have taken steps to apply the Intergenerational Wellness Framework as well as a Māori values framework over the top of work done in and with the Lab, to ensure an alignment with greater social and economic outcomes for New Zealand. The D7 Operational Thematic Group has met every month since February to discuss topics ranging from reusable components, getting value from data, emerging technologies, proactive services, open source. Where topics crossed over into other thematic groups, they were handed over (life events and health in particular). Legislation as code has been a topic of particular interest, including a request to do a short prototype of legislation as code in collaboration with other D7 members to demonstrate in November at the next D7 Summit. New digs! The Lab team moved venues twice in 6 months, and did not lose much productivity due to largely working on cloud based tools and to being quite agile and resilient in our work and culture. The SI Lab team contributed to various papers and reports including the AI Forum Report, various open, digital and inclusion government papers and blueprints, international research on innovation and digital government, and was invited to present to Canada, Australia, Singapore, Philippines, Estonia and Taiwan amongst other countries to share and learn. Upon realising the critical role the Citizen Advice Bureau play for service delivery to over 400,000 New Zealanders each year, the Lab worked with CAB to explore their user needs (anonymously of course, to protect client confidentiality). This provided a better understanding of the need to include trusted third parties in the channel strategy for government services and digital transformation. The concept of reusable components was proven through the delivery of functionality for SmartStart and the Rates Rebates Alpha. Financial Help (SmartStart) was based on the entitlements engine (legislation as code) which was also used for the Rates Rebates Alpha. Services near Me (SmartStart) was based on the services register (Family Services Directory made API enabled) which was also used for the Community Services Card demonstrator. Both reusable components are also being used by non government organisations for testing and the SmartStart infrastructure has also been open sourced for reuse. Below are a series of events run by or with the Lab team: We run monthly Emerging Tech workshops/showcases to help agencies keep abreast of new developments: The first event explored emerging tech and social trends, with special guests from the US Government Services Agency Emerging Tech lead, Justin Herman as well as Dr Rebecca Rumbul from MySociety Measurement in government and service delivery, we had 60 people RSVP. VR and AR (mixed reality technologies), we had 100 people RSVP. APIs for service delivery, we had 70 people RSVP. AI and what feeds it had 100 people RSVP. The Lab ran two Legislative Barriers for Service Delivery workshops resulting in a report that is being championed by the PCO. We supported a Better Rules Hack which tested the concept of legislation as code with the community, with public servants also coming to learn and develop skills in this space (40 people attended Wellington and 40 in Tauranga) The Lab team supported an Optimistic Futures event with InternetNZ and Victoria University exploring 50 year futures across 10 sectors and domains, and followed it up with a “Transitioning to an Optimistic Future” workshop in Techweek to explore how to get there, along with other TechWeek 2018 events. We facilitated and supported a Digital Service Standard Workshop focused on integration of a Māori worldview We ran a Rapid Prototyping for Virtual Reality workshop for industry and community, leading to a pipeline of opportunities around applying VR/AR and game design methods to service design and delivery in government. Report close The Lab has had a good year moving through startup phase to a small scale operational team that can support agencies in the design and development of better public services. An exceptional and highly skilled team has been established around the key goal of improving government services for New Zealanders, enabling systemic transformation of the public sector through collaboration and the application of design and development best practices with a whole of system, user journey and life event based lens. The team have operated under great uncertainty but have delivered above and beyond expectations to prove the value of such a cross agency function as an enabler of genuine service innovation. In June 2018 the Service Innovation Working Group (SIWG, the DCE level governance group) approved a $5.79m budget bid for the Service Innovation work program (including $2m for SmartStart and End of Life services), which would enable an acceleration of the life event based services development in the ambitious work program, which was also signed off by SIWG. Q1 2018 (July - Sept) will see the delivery of more design and delivery work, though it must be noted that the Service Innovation Lab team were unable to access the funding to expand capacity for accelerated delivery until August 2018, thus starting the 2018-19 financial year a little slowly. The gap between approvals and access to funding is a critical risk to progress on the agenda and must be minimised for future years. The work and the way of working (openly) generates a continuous pipeline of opportunities which will be presented to SIRG each meeting for discussion and prioritisation, where the opportunities align with and complement the work program as agreed. As a final word, I want to thank Karl, Darryl and the SIRG and SIWG participants for all their leadership and support. Thank you to all the agencies and Council staff who have worked so collaboratively with an open heart and mind. Thank you to all the companies, organisations & specialists who have shared in the journey, we look forward to working more with industry and non profit partners! A big thank you to the broader Service Innovation team who have provided support, secretariat, expertise and all the work needed to protect an innovation lab from the machinations of government :) Finally, my greatest thanks to all the special, talented, passionate and committed members of the Service Innovation Lab team. You are all exceptional in the work you do and your contributions have made a difference far beyond the scope of what any of us could have imagined. I look forward to seeing our efforts continue to transform, challenge, enable, empower and influence the system around us to truly be what our communities need."},{"title":"Transitioning to an Optimistic Futures Workshop - 18 May 2018","url":"/2018/08/01/Exploring-Optimistic-Futures-Workshop/","tags":["lessons learned","open source"],"body":"Led by Matthew MacCallum and Ben Briggs, Service Innovation Lab The following is content generated in the Transitioning to an Optimistic Future event held as part of Tech Week 2018. Duration 3 hours. Overview The event was designed to build on the concepts and discussions had as part of the Digital Seven Nations and Optimistic Futures Event. In particular we wanted to focus on the human aspect of transition and what would be required of New Zealanders in the future. The topics of discussion were chosen as they we all universally understood human features and common daily activities. This created a level foundation to debate from as opposed to getting caught up in complex technologies and paradigms that could distract and exclude. The role of technology was tightly framed as an enabler and second to behaviour, attributes and activity. Event Description: Building on the Optimistic Futures event held earlier in the year, in this workshop we will explore what’s required for New Zealand/Aotearoa to transition to a better future, moving from an 18th century to a 21st century society. This includes considering: the role of government the role of technology what foundations are needed to support society what role everyone would play in an optimistic future Brought to you by Victoria University of Wellington, InternetNZ and the Service Innovation Lab. This event is part of the Techweek series on Building Government’s Digital Service Innovation Capability. The room was divided into 4 large groups for discussion and exploration. Group share and reflection At the end of the day there was a group share and reflection which had the following insights. The initial discussion was not about the tech, it was about the people Of interest – dealing with someone’s intellect after death…and how this could benefit society Huge number of changes noticed with the activity – progressing from person’s exercise to societal benefits How will government incentivise the changes we’ve identified (that need to happen for optimistic future)? ** More intuitive change, tapping into the psyche of the people Noted we will share outputs from session plus what is happening at MBIE (digital strategy “speed dating” sessions) Starting off with the values was the right type of exercise J ** Had people think about what we’re trying to achieve/the end goal in mind Next conversations we need to have: ** Some kind of personal commitment – make it concrete ** Co-build a public facing repository of the information What caused most discussion: ** The ethical considerations + having a broader community discussion (beyond government) ** Where will the conversation take place + how do we bring other voices in? Activity One - Qualities to thrive as kiwis in 2070 Participants were asked to brainstorm qualities of an optimistic future in which kiwis could thrive and then chose 5 per group they felt were the most important. Word cloud of the key concepts from the workshop content The qualities identified (to reflect the word cloud above) are below. Qualities reflected in all four groups: Curiosity - (learn improve collaborate) Empathetic Qualities reflected in three groups: Adaptive Collaborative Confident Creative Qualities reflected in two groups: Bi-Cultural Compassionate - (Love, Mercy) Critically engages/thinking Empowered Environmentally aware/responsive Equitable Open Resilient Trust Finally, qualities reflected in one group included; Absentable, Abundance, Active, Agile, Ambitious, Appreciative, Audacity, Authenticity, Aware, Big picture thinker, Capability or automation, Capacity, Caring, Challenging, Considerate, Connected (place, people, history, whakapapa, turangawaewae), Courageous, Decisive, Diversity, Ethical, Explorative, Flexible, Generosity, Good natured, Honest, Hopeful, Hypocracy, Imaginative, Inclusive, Initiative, Innovative, Kind, Leadership, Love of learning, Loving, Maker skills, Mobility, Multicultural, Neighbourly, No structural inequality, Patience, Positive, Proactive, Productive, Proud, Reflect, Resourceful, Respectful, Responsible, Risk tolerant, Savvy, Self awareness, Smart, Social, Supportive, Sustainable, Survival Skills, Tolerant, Truthful, Values Driven, Visionary, Work/life Balance (2) The cumulatirve top 5 prioritised qualities list from each group were (number of groups): Empathy/sympathy/self awareness (3) Diversity (2) Creativity Critical Thinking Love of Learning/Curiosity Maker Skills Curiosity Trust Reflection Decisive Courageous Resilient Sustainable Kind & Inclusive Environmentally Responsible Ethical Resourceful Risk tolerant Full Definitions of prioritised qualities: Group 1 Def Empathy/sympathy/self awareness - understanding yourself, others and the impacts/consequences of your actions Important because: We are seeing the dehumanisation of people in our current systems. Our optimistic future is truly human centred Mātauranga Māori instead of economic outcomes, we measure social and environmental ones We want a trust based society, not blockchain one Rehumanise the workforce Creativity - expression, problem solving, making an intuitive leap, to make an idea tangible. Important because: It will enable us to have a viable empowered future Without creativity there is no progress Forward momentum and flow We can’t understand or express the art of the possible Learned helplessness and inability to envisage better systems Creativity makes people unique Curiosity and love of learning - desire to explore, understand the world around you Important because: In a changing world, a love of learning will enable us to advance and embrace change with joy. Change as an opportunity not a threat The world will only become more complex Love of Learning as a platform for your ability and confidence to respond to complexity Critical thinking - ability to discern truth, deconstruct content to value, truth and facts, ability to contextualise information - natural motivations, values etc Important because: Deception will become grander and more complex (especially technological ability to fabricate falsehood) Value truth over a good story Maker Skills - the skills and perspective that assumes you can form the world around you, you are not bound by the tools you have, you build what you need and are empowered to do so Important because: We have the tech to create anything - enables us to build bespoke solutions for what we need Don’t have to be passive consumers Empowered to be critical creative and make things Group 2 Defs: Trust - don’t fear interactions, know/respect boundaries and rules, vulnerability, it’s reflective/2-way, honesty, accountability - implied or explicit, foundation of the relationship, being treated as a human being Diversity - wanting to scan all options and ways of doing things, sense of self is valued, open ears, allowance for differences, ability to express views, how to channel power through process, inclusion, learning from others, rights, “recognising the power of paradigm”, respect for people, ability to participate, social norms Empathy - do things with people not to people, understanding without appropriation, try to feel what other people feel, empathetic > Sympathetic (empowering > Patronising) Curiosity - opportunity to learn, improve, contribute, at the top of the hierarchy of needs, in the boundaries of what’s acceptable, ethics, different power structures, may be self-disruptive, it’s good but can be dangerous. Reflection - share failures, transparency, look in the mirror, meditative, requires space and time, truth - don’t erase the facts, fits with work/life balance, understanding our past and learning from it, take pause and reflect integrate inputs Group 3 Defs: Courageous - Be brave about change, be willing to be the first to act. Resilient - Internal strength and ability to push through adversity with optimism and adaptability Kind & Inclusive - With compassion and responsibility actively enable and support participation in society and valuing differences Sustainable - Consider long term impact and understand we’re living from finite resources Decisive - To make decisions and act with confidence, with timeliness and being aware of trade offs. Clarity of thought, long term thinking. Being more comfortable with failure. Group 4 Defs: Resourceful - Curiosity, innovative adaptive and critically engaged Ethical - Empathetic, considerate, equitable Risk Tolerant - Confident, positive and patient in response to changing environment Diverse - Open, tolerant, values driven, respectful of difference Environmentally Responsive - Improvement driven, technologically fluent, climate disruption, responsive Important because: Innovate or Die Subjugation aint cool Without progress and the confidence to take risks only stagnation results Acceptance of diversity underpins respect Survival! Empathy - How does it work through technology? It’s a very human characteristic Activity Two - Performing actions today vs 2070 Participants were asked to choose one of the following activities and explore the process both today and in 2070 and how their qualities from Activity One might impact how they are performed. Activities: Start a business Get a health check Grow food - Group 2, Group 3 Visit a friend or family member Campaign for rights/beliefs Prepare a meal Do exercise - Group 4 Shop for a gift A day of high school Have a funeral - Group 1 Travel on holiday Below are the present and future states each group brainstormed. We intentionally looks 50 years out to think about new horizons rather than iterations on the status quo. Have a funeral - Group 1 Now: person dies of incurable disease, old age, car accident their passwords and access dies with them paperwork to formalise death - probate, govt processes obiturary in the newspaper funeral happens, people travel to it body is buried or cremated mind is gone mourning - family remembers them through photos, videos, letters, social media? religious and cultural components 2070: less unexpected deaths, so person has time to manage affairs, more euthanasia, plenned funerals bio tracking knows you’ve died, user-authorised services are notified and person’s wishes enacted - still human gatekeeper funeral - laws prohibiting satellite corpses, energy considered in body removal, homogenised religious/cultural approach? relationship to physical body changes as consciousness is able to be uploaded therapy for mourning An AI likeness lives on The life long learning of the person lives on in IP commons. Can someone else download a consciousness or ideas/knowledge from that person? Grow food - nutrition - Group 2 Now: Plan (space, season, crops, compliance) Prepare (dig, single vs family vs commercial consumption, water requirements, pest control, fencing, composting/supplements) Plants, maintain, harvest and back to planning with some automation employed for larger operations. 2070: Vertical, shared and more diversity in crops and methods Disruption to supply chain Tracability of crop lineage and social responsibility Better ways to measure the value of growing food Reflection, measurements and iteration on resource usage Empathy on food security and sharing Curiosity on food as medicine and eHealth Understanding how our past shapes our food Grow food - nutrition - Group 3 Now: Mix of mass and individual production Organics are popular Community gardens and distribution Highly seasonal - problematic Labour intensive - problematic New plant varieties not keeping up with climate change Inefficiencies - waste distribution Competitive global market R&D is great Environmental threats - pesticides, biodiversity, etc Farming is in our kiwi DNA Site prearation and decision making Resourcing - equipment and people Know your market and integrate with environmental factors Supermarkets dominate 2070 (with qualities): NZ developes best protein DNA DNA of cow - headless carcass with no pain (ethics) grow at home - 3D printing, predictive & inspiring, based on individual needs, land gets back to early state and rich biodiversity open sourcing of food production - sharing DNA code, incentivised social schemes & govt policy with different motives and measurements from today All supported by: decisive, courageous, resilient, sustainable, and kind/inclusive values. Exercise and healthy living - Group 4 Now: decide on exercise find and wear appropriate exercise clothes choose venue plan time find appropriate companions double check motivation book/schedule events transport to and from stretching and exercise review performance procrastinate at any stage 2070: greater access to diverse, affordable and open access options built into daily routine (treadmill desks?), big analytics focus Companions less necessary due to a) corporeal and b) human options Mental health reflection built in (mindfullness) Diary optimisation and automation More bio monitoring to optimise exercise plan according to need Generate power or credits from tasks Activity Three - Roles & Requirements Participants were asked to then reflect on the previous activities and discuss and answer the following questions: What effects could this have at a community or national level e.g. benefits and challenges? Should government play a role? if so what? How could technology enable these? Group 1 - have a funeral National and Community level: Pragmatics sorted control Will of how your ‘mind’ can be used after your death How can you participate in society after you die? E.g. can you vote, give testimony etc. What are your rights How does this effect whakapapa? Does your mind get passed down - whole new oral tradition Can virtual minds aggregate knowledge/take action? E.g. indigenous minds protect against colonialism Role of Government: Does government ‘own’ its citizens minds after death? Can a person choose a different nationality after they die? Protecting a persons rights/privacy after they die How can technology enable: Safeguards - controlling/choosing how your mind can be used/altered - git control not blockchain Death bureaucracy automated Having your own AI avatar as executor Living on virtually after death Group 2 - grow food/nurtrition Effects on Community/Country: Sharing economy Will we be able to “grow” meat? Nutritional Value Based on values = optimistic future = no gap Role of Government: Regulations/framework across/ standards Research - promote/encourage = partnership with academia Local government - info on soil, percentage of public land available to grow food? How can technology enable: Robots Soilchecking Fruit salad trees via grafting Enable traceability Water conservation Meteorological forecasting Nutritional check GMO? More nutritional Harvesting distribution based on need Group 3 - grow food/nutrition Effects on Community/Country: Position NZ as quality and food experts Better use of global resources Our small population means being able to test and identify benefits quickly Better health through personalised food solutions Less ethical dilemma over consuming protein More options for learning about alternatives Equality and no poverty Role of Government: Education on how it works Regulation of ‘programmable’ food Maintain a group of people who are aware of the tech Incentivise communities for uptake How can technology enable: Sharing IP (open source) Benefits: History of being a primary provider Decreasing food scarcity Challenges: Identity crisis Changing mindsets may take a while to get there Socialising change in food production Isolation is possible - too much time with nothing meaningful to do Reliance on technology Group 4 - do exercise Effects on Community/Country: More likely to try different things as potential lower risk Specialisation in work/activities Who will be motivated to fund? Medical insurance, government… Medical /physical/mental health measurement, monitoring and development - more efficiency and comparatives Community contribution = credit generation (?) Early diagnosis Role of Government: Funding Enabling and encouraging activities Exposure to different roles and activities Provides right guidelines to encourage healthier choices + private sector innovation in this area Regulation for ethical implications of data use How can technology enable: Regular open and VR access Regulate or schedule daily routines Monitors detect physical level and give optimal preparations Key themes of the effects on Society Participation in society before and after death Sharing of knowledge and passing down generations Specialised in what we do and offer Key themes Tech: Traceability and control Knowledge sharing Key themes Role of Govt: Encouragement and incentivisation Measure and evaluate Protect privacy"},{"title":"Exploring the Notice of Sale Process","url":"/2018/10/12/Exploring-the-Notice-of-Sale-process/","tags":["lessons learned"],"body":"Authored by: Glen Thurston and Nadia Webster Contents In summary What is the notice of sale and why is it important? Possible solution Next Steps Exploring the Notice of Sale process Exploring opportunities to improve the notice of sale process as part of the life event of ‘selling and buying a property’ A collaboration between: The All of Government Service Innovation Lab Auckland Council Land Information New Zealand Tauranga City Council Wellington City Council Whangarei District Council In summary In August 2018, a collaboration led by the all of government Service Innovation Lab with Auckland Council, Land Information New Zealand (Valuer General), Tauranga City Council, Wellington City Council and Whangarei District Council explored the Notice of Sale (the notice) process as part of the ‘selling and buying a property’ life event. This group believe that there are a range of possible solutions to improve the notice; for the benefit of people selling and buying property, their agents (ie real estate agent, solicitors, conveyancers), Councils and government agencies teams. During August, the group explored: The role of the notice and its importance, Goals for the future of the notice, Pain points and experiences that people and organisations involved with the notice are having, Potential opportunities/solutions for improving the process. The work was completed in three parts, a current state review with the Wellington based group members, a design intensive in Auckland (13-16 August) followed by the write up of the findings of both the review and the design intensive. The goal of this work was to help the group of interested parties identify a path forward to improve the notice process. It helps scope up future design work that would be needed to explore the opportunities in more depth to ascertain their desirability from a user perspective, viability from a business sustainability perspective and feasibility from a technical perspective. The design intensive identified the following next steps that are needed to continue this work: The need for a sponsor(s) to help drive continuing this work. The Lab could lead a discovery with the support of this group to investigate the preferred data based possible solution in more detail to test its viability, feasibility and desirability. The Councils collectively or individually could investigate the other two solutions identified; in the intensive; Improve communication between Councils and Solicitors and data validation flags to help select the correct process to use. What is the notice of sale and why is it important? The Notice of Sale (the notice) acts a conduit of sales and/or property owner information in the property transfer process and its a legal requirement that it must be supplied to a Local Authority1 (ie Councils) as part of the Local Government (Rating) Act 2002. For a Council the notice is typically the first contact they have about the transfer and importantly the new owner of the property. This allows them to update the rating information to send out the rates notice to them. The notice includes valuable sale information where a sale is involved (eg tells them how much the property sold) for which is important for the valuation purposes as it helps give an indication on the valuations for an area. Rates and valuations are linked together and the notice is one of the key inputs into this process. The notice gives more information and data about the property that helps to give a better indication of valuation and therefore the rates to charge. The rating and valuation process (Flow chart showing that Valuation cycle & Local Authority actions feeds into the Setting and billing of rates, then to Property Owner.) In addition to the rating process the notice also acts another way to provide information that the property title has changed too. The notice of sale and its relation to rating and valuation (also see Appendix 1 for the key concepts required under legislation and what triggers a change of ownership, and see Appendix 2 Data Map for what data is collected at each step in the process) (Notice of Sale decision tree. Path 1 - Notice of change of ratepayer and/or their contact details of whole or part of the rating unit; Council finance team accountable fo calculation of rates. This is Audited by DIA; Council valuation team accountable for valuation data being correct. This is audited by LINZ valuer general. They determine structure of data extracts for comparable analysis. Path 2 - Notice of change of title (i.e. creation of a new title and cancellation of existing title); Register of Titles; Valuation Service Providers (VSP). They are accountable for the calculation of valuations. Councils are also required to provde the correct data/information to contirbute to the calculation.) The notice must contain these points: The full name and address of the purchaser or transferee; and in the case of a sale, the sale price. It has to be supplied to the Council within one month after the sale or transfer of a rating unit by the person selling it. Key legislative references are: Sections 31 - 33 and 36 of the Local Government (Ratings) Act 2002 Section 52 of the Rating Valuation Act 1998 There is no prescribed form for the notice or methods to transmit the information to Councils. The notices vary depending on the other information requirements that Councils request or what solicitors typically want to send to support the sale. The QV sales direct online form was originally built around what is mandatory but has been amended over time based on solicitor and council requirements; most notably contact details for new owner. There is also no definition for the term ‘property’ as it’s not a clear concept. From a rating perspective at Councils it’s the title and rating unit. Statistics From the LINZ Rating Valuation Data set, the following table describes the number of sales between 2014 to 2017. Number of Sales 2014-2017 (Table showing the number of sales between 2014 to 2017 with sales totalling to 229,855.) While the majority of property transfers are residential, there are a range of complex sales that are harder to facilitate and process. These include: Farm sales Subdivisions Apartments and unit titles Commercial buildings Earthquake prone buildings Maori leasehold land Leasehold titles Trust and trustee changes Result of river changing boundaries The notice and its importance to NZ Inc The notice directly help contribute to understanding New Zealand’s Financial and Physical Capital as defined in Treasury’s Living Standards Framework (LSF). This framework draws on OECD analysis of wider indicators of wellbeing with the starting point is answering three questions: What are current outcomes? Will these outcomes be sustained or improved? How resilient is the system? The LSF is based on four capitals that organise indicators of sustainable intergenerational Wellbeing and for the notice Financial and Physical Capital is most applicable. This includes: Financial and physical capital includes the buildings, machines and equipment and other conventional investment, including capital spending by government. The financial assets of households provide resilience to unexpected life events and retirement. Housing is a major contributor to current wellbeing and is the highest-valued household asset. How do we link the information contained in the notice and use this with other data sources and use this for measuring the health and resilience of New Zealand properties and therefore contribute to Financial and Physical Capital wellbeing? There is an opportunity to use the notice of sale data linked with the core rating valuation data to provide profiles of the housing stock of New Zealand ie that is we know the owner/occupier vs rentals, type of housing, construction, age, spacial (ie where they are located). What else could the data be mashed up with? What stories could this tell and what it could inform? Open data The notice of sale information is deemed to be ‘open data’ ie it’s data anyone can use and share. It has an open licence, is openly accessible and is both human-readable and machine-readable. To protect the integrity of the property sector the data needs to be made available to aid with transparency and avoid corruption. The Design Intensive The challenge for the Notice of Sale design intensive was to explore what a positive, effective customer experience looks like when based on a real-world life event (see this blog post about the value of life events). The design team sought to understanding the big picture associated with notice of sale and where it fits within the life event of selling and buying a home and together seek to understand the desired outcome from different perspectives and identify indicative opportunities to achieve these outcomes. Representatives from Whangarei District Council, Auckland Council, Tauranga City Council, Wellington City Council, LINZ and the Service Innovation Lab (the lab) were involved as team members involved either before and/or during the three day intensive between 13-15 August. During the intensive we wanted to explore in the design sprint: High level understanding of where the notice of sale fits within the life event of selling and buying a property Generate a collective understanding of the goals we seek for notice of sale. Reveal the pain-points, opportunities and constraints for the customer, agents, third parties and government agencies teams and understand what their motivations are. Reveal service bottlenecks, dead ends and successful interactions Explore any possible outcomes that could be developed that ease the pain-points Explore if there is an opportunity for reusable components to be created During the three days of the intensive we covered: Day 1: Gather – Outline the complex problem, goals sought, audiences involved and their motivations Day 2: Define – Assess problems, opportunities and constraints, themes Day 3: Ideate / Visualize – Scenarios for our audiences and how we might make change This is based on the following logic mapping flow model2(as shown below) developed by Dr Hazel Bradshaw from the Service Innovation Lab: (Logic Mapping Flow diagram. Starts with Complex Problem; Overarching Goal; Audience Types; Motivation(Intrinsic); Motivation (Extrinsic); Problem/Pain Points; Constraints; Emerging Concepts; and lastly IDEATE.) The complex problem Buying and selling a property is complicated transaction, it requires information to be exchanged between a number of parties and if errors are made it has consequences for property ratings and valuations. This can lead to stress and have financial implications for the parties particularly the property buyer. The team considered this complex problem and were asked to consider the life event in the context of the notice of sale. Here are the themes the team identified: Target theme - Automation The theme selected as a focus point was Automation. The team would like to automate as much of the current manual process as possible to improve the quality of submissions. They’d like to get rid of the term “notice of sale” from their vocabulary to allow time to focus on more important or higher value interactions with ratepayers and clients. They’s like to to see data entered once and transmitted electronically to all the stakeholders involved in the process (preferably from a single place). It was noted that automation should not be at the expense of verification, accuracy and completion. Other themes in order of importance to the team Single source of truth. There is no current single source of authoritative data for the notice of sale that anyone can draw from eg no one reference number that follows a ownership transfer for parties to use. Team were quite fixed on this as a solution. Data quality. This includes accuracy and completeness. This involves changes in ownership that were not notified to the council or were lost somehow plus the accuracy of the received notices and its input into multiple systems. The discussion also revealed that there is also a need for more information that is needed to complete tasks that is not in the mandated information that must be sent. Eg contact details, postal addresses. The consequences of data quality include the number of manual checks and validation points throughout the process. Most systems also cater for happy day scenarios too. Timeliness. The team advised they need the notice information to be supplied as soon as possible to allow more value add tasks to be completed eg audit. Improving council experience. Because the notice is a a major part of the councils rates and valuation teams business, it takes up a large chunk of their time and they’d love to streamline the work for the sake of accuracy, auditing and sanity. Improved customer experience. The team are passionate about making life better and easier for our customers. From a solicitor perspective it’s about the desire to improve the process for the profession and their clients. Hopefully improvements will lead to an increase in trust between all parties. Data transmission. The notice needs to be sent to many parties, how could this be made easier? How do we make it more user friendly for solicitors to provide information? Goal setting - What are the end goals The team considered the goals associated with the complex problem statement - why is a goal important for this work? what does it look like? These end goals were identified for the notice both from a higher level and a specific goal to focus on for this design intensive. The higher level goals were: Will improve the accuracy of sales and owner information that will ultimately result in better rating valuations and revaluations. Consistent, complete information that drives decision making and innovation - one source of truth for all market participants eg buyers and sellers, real estate agents, councils, central government. Better data helps contribute to better economic outcomes especially considering how property is a big driver in NZ economic success. Helps improve the quality of house and property owners interactions with Council - often their first contact is a compliant due to an error with the rates and valuations. Improved service for people involved in sales and transfers. The goal selected for the intensive was Data Quality - this is needed for the rating and valuation tasks. This includes missing sales, accuracy of the data received and needing more information beyond the current notice rules to complete tasks. It was recognised that to help with the theme of Automation data quality will be a key enabler. From this there were some sub goals: Efficiency of process for everyone to free up people up to do higher value things/work Trust in data and process integrity to meet compliance requirements and ensure confidence for property owners. Related themes to data quality (in order of importance) were accuracy and completeness of the notice, verified data within the notice and ability for data sources to be linked. Other themes were improving the process within Councils, efficiency of process for all parties by creating less touch points and making compliance with the process easier. It was noted that data quality would help mitigate the problems people encounter that are represented in the other themes. Audience Mapping The primary audience for the goals and theme is Council teams plus the agents (solicitor / conveyancer) who facilitates the notice for property buyers and sellers. Their relationship is key to the notice process being completed and sent to Council but also how issues are identified and resolved together. There is also a difference in expectations between the two regarding the amount of data that needs to be supplied to ensure that the new owner of property is correctly identified and billed the right amount of rates. Council teams included: customer data coordinators, customer services staff, digital capture, revenue, mailroom, credit control. For the agents this also extends to their professional bodies, individual practices, legal executives and secretaries, juniors. The secondary audience is LINZ most notably the OVR, Valuation Service Providers and third party utilities that directly need the NoS eg Watercare. These groups are essential for the valuation of properties and the notice is seen as the “life blood” of rating valuation and “without it we have nothing”. Customers were considered to be the the old and new owners of the property, third parties who consume the data, ratepayers, real estate agents, government agencies who consume the data, software developers, office of auditor general. These groups of customers are impacted by the notice especially if there is issues with the data quality for a property but for the most part they will not be directly affected. Motivation Mapping - Intrinsic and extrinsic (Table showing the Intrinsic & Extrinsic motivations for Primary audiences (Councils & Solicitors) and Secondary audiences.) Problems the audiences are having To consider the problems the various audiences are having the team were asked to map out the journeys for the solicitors and council teams. Prior to the intensive, a service blueprint describing the journey from presale triggers to post-sale settlement was created and this was used by the team as a reference for their maps. (Flow diagram of the Notice of Sale Process. Pre-Sale; Sale & Purchase agreement signed; Unconditional; Settlement (can be up to 6 months before Settlement); & Post-settlement.) Solicitor journey map (Post-it notes for Journey Map. Votes on Education/Action Points; & Unreliable Data.) (Post-it notes for Journey Map. Votes on Incorrect or Missing Data; Human Error; & Duplicating Information.) Council journey map (Post-it notes for Journey Map. Top votes on Manual processing/checking including multiple handling of the notice.) The journey maps revealed a range of pain points. The pain point themes were: Education and knowledge at key action points Unreliable data Problem themes Duplication of information Human error Incorrect or missing data The notice is not received Manual processing/checking including multiple handling of the notice Difficult to find and match data Churn - checking, comms, rework These selected themes were turned into problem statements using the following format: As a [audience type] the problem I (or we) have is [pain point]. This impacts my ability to [task or outcome the audience is trying to solve]. The problem statements were consider and themed to identify common elements with the top three themes consolidated into these problem statements: Problem statement one - accurate and complete information As a solicitor, I have a problem with providing accurate and complete information to councils about the property being sold, transferred or changed eg its location address and the Council or Territorial Local Authority and about the property owner (eg their name and contact details incl their postal address, email, mobile number). This impacts: my ability to meet my client needs, to do a good job and ensure my compliance with the rules. Council’s ability to efficiently process changes to property data, rating database and comply with rules Council’s ability to contact property owners Council workers ability to do a good job, deliver a good service to ratepayers and improve the Council’s reputation. For each problem statement the team considered if there are any constraints associated with it and how hard it might be to resolve them: (Table matching Ability to resolve a constraint (Easy; Medium; Hard) with Constraints.) Problem statement two - manual processing As a Council administrator, me and my team leaders have a problem with the large amount of manual processing to complete the input of the notice of sale. This impacts our ability to: approach this task with enthusiasm and makes my job boring save money for ratepayers that could be better spent on things in my community work well with solicitors, who through our processing errors will have difficulties with their clients (Table matching Ability to resolve a constraint (Easy; Medium; Hard) with Constraints.) Problem statement three - triggers for notice of sale As a Solicitor the problem I have is that I don’t know all the triggers for the Notice of Sale and its importance to rates and valuations. This impacts my ability to: meet my clients needs work with councils and their need for information for rates and valuations, payments and refunds and debt collection. (Table matching Ability to resolve a constraint (Easy; Medium; Hard) with Constraints.) The team believe that if these problems were fixed then it could resolve many of the problems described in the other themes. These other themes that resulted from the creation of the problem statements were data input and matching, manual processing and validation, not sending or receiving the notice, the impacts of errors and the impacts to the value of the team and individuals within it. Scenario and storyboard building - exploring problems and solutions To explore problems and solutions for these scenario and storyboard techniques were used. The team created a scenario that addresses the audience problem, meets the a clear goal and works within the constraints. A scenario should have an audience, a goal, a set of constraints and a beginning, middle and an end. These were themed and storyboards were created based on the prioritised scenarios. Each person shared their storyboards and then team was separated into groups who took the scenarios, identified their common elements and collaborated to create a refined storyboard. (Team collaborated to create a refined storyboard from the common elements of the scenarios.) Problem statement one - accurate and complete information A range of scenarios were created and many had similar themes. Here are the priorised themes las decided by the group: Property transfer in a single portal - data validated against authoritative datasets. Accurate ratepayer contact information - education of ratepayers Correct Correct or territorial local authority selected - against an authoritative dataset Tied with no votes: Councils validate their databases against authoritative datasets, solicitors validates data against authoritative sources, accurate ratepayer contact information - verified against authoritative datasets. Here is the storyboards for the property transfer in a single portal. (Storyboard for the Property Transfer made up of post-it notes.) This storyboard was ultimately the one selected to explore further during the rest of the design intensive. Problem statement two - manual processing A range of scenarios were created but they had a similar theme - property transfer in a single portal. Here is the storyboards for the property transfer in a single portal. For the refined storyboard because of the similarity with those created in statement one, they should be combined. Problem statement three - triggers for notice of sale There were two themes that were tied in priority: Improve communication between Councils and Solicitors - spending time together Rules and data validation flags to help select the correct process to use. Here are the refined storyboards. The team believed that these ideas could be something that could be done within each Council and trialling the approach with local law firms and conveyancers. Improve communication between Council and Solicitors - ‘spending time together’ Rules and data validation flags to help select the correct process to use. Possible solution The idea behind this possible future state is that much of the data required to action what is currently called the ‘Notice of Sale’ process is captured within the Sales and Purchase Agreement or through the Transfer Instrument (see Appendix 2 Data Map for what data is collected at each step in the process). There are different triggers for this process (see the triggers in Appendix 1), which is actually the process of changing the ownership of a rating unit. Rather than expecting each person in the process chain to perform manual data entry then we could imagine a process where the data is kept as electronic data and systematically pushed through the required states of a workflow. Ideally this would satisfy the legislative requirements (see Appendix 1 for the key concepts required under legislation) while achieving the goal of improved data quality and improved trust in the process. (Flow diagram describing the Change of Ownership of a Rating Unit - Future State version 0.2) This future state needs deeper investigation to determine its desirability, viability and feasibility, and would necessarily involve a slow transition, including improving data quality within the various databases over time. A Minimum Viable Product might involve manual data entry from the Sales and Purchase Agreement into a data integration tool, or an upload of a data extract from a smart form version of the agreement. Next Steps The group discussed the need for a sponsor(s) to help drive continuing this work. It was agreed that the sponsor could be a person or group of people but they should be at be at an executive leadership level eg a CFO. The group of councils involved with this exploration will need to work together to identify a sponsor(s) and brief them on this work and its importance. Depending on the priorities for the 2018/19 Service Innovation Lab work programme, the Lab could lead a discovery with the support of this group to investigate the possible solution in more detail to test its viability, feasibility and desirability. The Councils collectively or individually could investigate the other two opportunities identified in the intensive; Improve communication between Councils and Solicitors - spending time together and Rules and data validation flags to help select the correct process to use. The team believed that these ideas could be something that could be done within each Council and trialling the approach with local law firms and conveyancers. This is being currently being explored further collective team. Appendix 1 : Notice of Sale Context Diagram This diagram maps out the relevant concepts in the legislation relating to Notice of Sale to help with understanding the current legislative requirements. To read the diagram follow the arrows, i.e Ratepayer (Owner and/or Lessee) owns or occupies Rating Unit; Rating Unit created, maintained and held in District Valuation Roll. (Diagram of concepts in leglislation relating to the Notice of Sale process.) Triggers for notice of change of ownership of a rating unit Although commonly referred to as a “notice of sale”, that’s actually a bit of a misnomer as it not just sales that trigger the need for a notice. Broadly speaking, there are four triggers: If an owner sells or otherwise transfers a rating unit or any part of a rating unit (section 31(1) Local Government (Rating) Act 2002); If a person becomes the owner of a rating unit by operation of law (section 31(3) Local Government (Rating) Act 2002); Registration of a change of name of a rating unit (section 36 Local Government (Rating) Act 2002); and Transfer, assignment, surrender or termination of lease (sections 32 and 33 of the Local Government (Rating) Act 2002). In the case of a sale of a rating unit, Section 31 of the Local Government (Rating) Act 2002 provides that a vendor or, if the vendor has an agent, the vendor’s agent must, within one month of the effective date of sale or transfer, provide the relevant local authority with: the full name and address of the purchaser; and in the case of a sale, the sale price. The legislation does not mandate the form in which the notice is provided. Additionally, there is no definition of “sale price”. In all other cases, the transferor (former owner) must notify Council of the change in owner of the rating unit. Again, the legislation does not mandate the form in which the notice is provided. So which instruments trigger the need for a Notice? The sale of a property which results in the registration of a transfer instrument is the most obvious trigger for a Notice, but it’s far from the only one. Other common transactions which trigger need for a Notice include: Dealing with an estate resulting in registration of a Transmission (instrument quick code TSM) A mortgagee sale resulting in registration of a Transfer in exercise of Power of Sale (instrument quick code TPS); Registration of a Joint Family Home application (instrument quick code JFH); and A change of name of an owner (due to marriage or a company changing its name) (instrument quick code CN). Additionally, there are a number of less common transactions that could trigger need for a Notice – some of which are incredibly rear. For example: Transferring assets on the winding up of an Incorporated Society resulting in registration of an application under section 27 of the Incorporated Societies Act 1908 (instrument quick code A27); An application for accretion as a result of changing river boundaries (instrument quick code ACC); An application under section 99A of the Land Transfer Act 1952 to record a statutory vesting (instrument quick code A99A); and An application to transfer land as a result of the Health Sector (Transfers) Act 1993 (instrument quick code A9). Appendix 2 : Notice of Sale Data Map This shows what data points are collected through what mechanism at different points in the sale or change of ownership process, and what the data source is and where it goes. (Notice of Sale Data Map.) For the purposes of this report, Local Authorities will be referred to as Councils. ↩ Bradshaw, H. (2014). The Structural Playability Process (SPP )-An Effective Design Process for Educational Computer Games. chp 3, p60 ↩"},{"title":"Rates Rebates (Te Whakamāmā i ngā Reiti)","url":"/2018/11/30/Rates-Rebate/","tags":["rates rebate"],"body":"Authored by: Siobhan McCarthy and Glen Thurston Contents Overview Background The Discovery The Alpha Insights from Discovery and Alpha Next Steps Appendix One - Service Blueprints Appendix Two - Trend Analysis Appendix Three - Comparison between the web app & current paper application A collaborative initiative between Department of Internal Affairs and Local Authorities supported by the Service Innovation Lab Overview ‘A Rates Rebates’ is a subsidy (up to $630) for low-income homeowners on the cost of their residential rates. The subsidy is delivered by Local Councils and is administered by Central Government (specifically the Department of Internal Affairs - DIA). The entitlement value is calculated by the cost of the rates, applicants income, and number of dependants. The maximum subsidy amount is reviewed yearly. The Service Innovation Working Group (SIWG) within the Digital Government Partnership supported by the GCDO, prioritised and approved an initiative to explore the design and delivery of a proactive service with the goal of being to create an automated service. Rates Rebates was identified as a service for this initiative based on research for the becoming a senior life event. This collaborative initiative was between DIA as the lead agency (ie business owner) and Local Authorities (ie Councils) supported by the Service Innovation Lab (the Lab) in the delivery of the work through the Discovery and Alpha phases. Through a phase of work called a ‘discovery’ the Rates Rebates service was mapped and reviewed, internal and external stakeholders were interviewed, and potential methods of service delivery were explored. The discovery revealed many opportunities at the system level to improve the experience for both the people applying for their entitlement and people delivering the service. A minimum viable product (MVP) was designed and developed between March—May 2018 and an online service for rebate applications was trialled in Tauranga from 21 May—30 September 2018 with Tauranga City Council. This phase of work was called an ‘alpha’. The alpha was focused on testing system changes. Tauranga City Council, Auckland Council was involved with assisting with the design and test of the alpha and numerous councils have been watching progress closely. Both the discovery and the alpha identified that there is desirability to progress the alpha service to full production from both an applicant and local councils perspective and the Lab is currently supporting DIA to explore how to transition the alpha to a Beta (ie first live production). This report incompasses all the work the collaborative team (ie DIA, local authorities and the Lab) has been involved with to date with Rates Rebates. It contains background about the Rates Rebates scheme, insights found during both the discovery and alpha, a description about the recent alpha work and the discovery that underpinned the work. Combined, this provides a complete picture of how we (ie the collaborative team) did the work, what we learned and our recommendations for making rates rebate an automated service that could could form part an integrated service for specific life events (eg Becoming a Senior, Needing Financial Assistance). Background Why was this brought to the Service Innovation Lab The Rates Rebates entitlement was identified as a proactive entitlement for the Service Innovation Lab to explore by the Service Innovation Working Group. Because of the large number of applicants who are Superannuitants, this is also a service that is considered to play a part in the “Becoming a Senior” life event. Who has been involved? Discovery Phase Department of Internal Affairs, Tauranga City Council, Auckland Council, Wellington City Council, Ministry of Social Development, Inland Revenue, Assurity, Service Innovation Lab. Alpha Phase Tauranga City Council, Department of Internal Affairs, Auckland Council, Service Innovation Lab, The entitlement in numbers In the 2016/2017 rating year 97,947 rebates were granted, of those 80,486 were the full $610. The maximum subsidy amount is reviewed yearly - for 2016/17 the maximum was $610. In 2017/18 the maximum is $620. In 2018/19 its $630. The trend shows the number of rebates granted each year going down. This is a well known trend and is mostly due to the income threshold not keeping in pace with the rise in superannuation payments year to year, leading to those on the couples super especially, gradually dropping out of eligibility. Other factors include housing affordability and lowering home ownership rates - Appendix Two1 contains more information on this trend and causal factors. There is not enough data available at this time for us to know: How many apply and are rejected due to inconsistent implementation processes across council How many people are eligible across Aotearoa New Zealand How many know their eligibility or that the entitlement exists, and How many choose to apply or not. Rating year Maximum rebate Rebates granted Value (inc GST) Average Rebate Full (maximum) rebates granted Average rebate granted < maximum 2010-11 $570 112,181 $59,131,590 $527.11 91,941 $332.27 2011-12 $580 115,187 $62,340,668 $541.21 95,988 $347.29 2012-13 $590 111,021 $60,231,307 $542.52 90,857 $328.59 2013-14 $595 106,416 $58,086,259 $545.84 87,209 $322.64 2014-15 $605 104,410 $58,092,996 $556.39 86,047 $328.63 2015-16 $610 102,208 $57,102,376 $558.69 83,737 $326.07 2016-17 $610 97,947 $54,655,977 $570.23 80,486 $318.40 2017-18 $620 97,609 $55,496,610 $568.56 80,810 $321.00 Rebate amendment In February 2018 the Rates Rebate Amendment Act 2018 was passed that grants those who live in retirement villages eligibility to receive Rates Rebates, expanding the number of eligible by approximately 25,000. Data from last year suggests 36,618 people currently live in retirement villages, these are comprised of 28,168 units. Some of these units were already eligible to apply under the old legislation if they were rated separately and in the name of the resident. We don’t have numbers for this but it’s a minority of units, most units are newly covered by the recent legislation. High level estimate of units newly eligible to apply is around 25,000. The number actually eligible to receive a rebate will be much lower due to income levels and value of rates. For example, most couples aren’t eligible as the couples superannuation income, together with having relatively low rates precludes a lot of them. Our key stakeholders Ratepayers Those eligible for a rebate are people who own and live in their home with an income level below a formula determined by their rates. Local Government Application forms are accepted by Local Government, who do initial processing of the entitlement and apply it to applicants residential property rating accounts. Department of Internal Affairs (DIA) DIA administer the rebate, are responsible for the paper forms, which they deliver to councils, and are responsible for the payments of rebates to be made to local councils. Pain points for applicants and system During the discovery and the alpha phases we explored all aspects of the rates rebate experience from the perspectives of the users or applicants who apply for their entitlement and the people who are involved in the system of facilitating, checking and approving the applications. Applicants The complexity of application creates a poor customer experience Lack of awareness of rebate entitlement for potential applicants and in social security support systems Citizen time The current system is estimated to cost $1m in citizen time alone2. Issues affecting mobility and access Due to many applicants being over 65 and/or with disabilities, the impact of the requirement of Statutory Declaration in front of a witness impacts accessibility for the core customer group. System The process is very manual and involves costly double handling. Applicants must fill in the same information and apply every year even when their information does not change. Preventable cost of implementation to councils and wait times for payments back to councils from DIA Prescriptive legislation preventing an end-to-end digital experience The discovery In​ ​September​ 2017 ​the ​team​ ​kicked​ ​off​ ​a​ ​three-week​ ​discovery​ ​sprint,​ ​exploring​ ​how​ ​subsidies​ ​are provided​ ​to​ ​New​ ​Zealanders​ ​and​ ​what​ ​ ​that​ ​could look​ ​like​ ​in​ ​the​ ​future,​ ​with​ ​a​ ​focus​ ​on​ ​Rates Rebates.​ ​Rates​ ​Rebates​ ​are​ ​an​ ​entitlement​ ​that​ ​has​ ​been​ ​identified​ ​as​ ​a​ ​key​ ​pain​ ​point​ ​for​ ​applicants (low-income​ ​property​ ​owners​ ​for​ ​primary​ ​residences),​ ​as​ ​well​ ​as​ ​for​ ​Local​ ​and​ ​Central​ ​Government. The discovery sprint included service designers, user researchers and subject matter experts from the Department of Internal Affairs (the Service Innovation team as well as the Rates Rebates team), Auckland Council, Tauranga Council, Wellington Council, the Ministry for Social Development and the Inland Revenue Department with support from Assurity. Week One - Kick off Focus points The team identified the following focus points for the three week sprint. Understand​ ​and​ ​Complement​ - Previous Rates Rebates insights focused on the process from an applicant perspective, our team will collect and analyse insight from multiple perspectives including Central and Local Government agencies. We are also looking for additional applicant types that have not been spoken to before and understand the size and demographics of the eligibility groups. Local​ ​and​ ​Global​ ​Picture​ - We are exploring the local and global community and identifying similar concepts, prototypes and entitlement models that we can factor into our concept development. Data​ ​Path​ - Exploring the data path of the process, data ownership, authority and declaration and what this could mean for implementation of any automated concepts. Thinking​ ​Big/Parallel​ ​Value​ - How could this be applied across all of government services. Week Two - Customer research and journey mapping Service blueprint Service Map The Rates Rebates Process touches many agencies. We mapped the journey to see touch points for rebates customers, front stage (agency work visible to the rebate customer), and backstage (agency work not visible to the rebate customer). It showed a very complex picture with a lot of pain across users, Councils and Central government agencies. Considering this entitlement is a maximum of $610 per year, it requires a lot of cost and time from all participants in the process to administer. To view the journey in more detail, please use this link: https://docs.google.com/drawings/d/1G3cs66o7u-xwJWr2FT46cd5UivJ-HojpcS3I-Q5bSOY/edit?usp=sharing Personas We created the following personas based on the customer groups identified to compliment the personas made in the previous discovery work. Working mother Hannah lives in Southland, looking after her three kids and doing some freelance work in her spare time. She is very capable, but going into town can be a bother – she borrows a car from her neighbour and it’s not always available. Because she lives rurally, she likes to do more things online. She’s short on time and money is always tight. She has found out about the Rates Rebates and wants to get it – but she’s also short on time and not sure if the bother is worth it. Superannuant Jennifer is a retiree living in a block of flats in Wellington city. She doesn’t drive anymore, but manages to get around fine on public transport. She thinks of herself as pretty independent, but sometimes she needs to help with her finances and paperwork – she’s not as good at reading the fine print anymore. She uses an iPad to look at FaceBook and the news – but doesn’t do much else online and doesn’t like the idea of her personal details being somewhere out there. She’s a repeat applicant for the Rates Rebates, and considers it a nice bonus. Supported Living dependant George lives in a suburb in Tauranga. He suffers from a physical disability, and depends heavily on his support person for any physical activity. Money is tight and he budgets carefully – allocating all of the money that comes in. When there is a delay, it’s a real issue. He has lots of interaction with government to claim various benefits and he is comfortable with doing things online - but he doesn’t have his own computer. Week 3 - Concept development and testing We tested 3 concepts, hypothetical ways the process of rebates might work, based on data sharing between agencies, to help make the process easier and efficient. We tested the concepts with those we interviewed to find out their thoughts and opinions. We spoke to 17 ratepayers that covered different demographics to map their experience and pain points. A large portion of them were women and retired, building on previous research from Internal Affairs. Option 1 - Assisted automation opt-in There were varied reactions to this option. Some said they saw issues with it being online, mentioning they know a lot of people in their circles who get rebates and do not have computers or feel comfortable using them. Others liked this but often said they preferred option 3 after they had seen all options. Some suggested that they liked the idea of the service being provided by phone, and suggested that there may be a way for them to make a verbal declaration in place of Statutory Declaration. Option 2 - Automatically apply rebate This option was usually popular, until option 3 was shown and then they decided that this was something they did not actually want. As they were unsure what this would mean if the information was wrong or felt uncomfortable for the govt to be talking about them and deciding things without their knowledge. Many felt that this option was a bit “big brother.” Option 3 - Auto populate data Option 3 was the most popular. People were usually most comfortable with this option as they felt that it still let them be in control, but also made the complex process less work for them. Some felt uncomfortable about their data being shared without their permission and knowledge, and didn’t like the idea of the government ‘talking about me’ as they did not trust the government completely. Many users had the attitude of ‘they already do this/know this information anyway’. The Alpha The Future of the Rates Rebates Service In the Discovery phase there were a number of opportunities identified for service improvement. We also identified barriers from the prescriptive legislation, an Act written in 1973, that impacts what is possible for digital service delivery in 2018. Of the three concepts tested, based on data sharing between agencies to help make the process easier and efficient, option 3 (auto-populate data) was the most popular. People were most comfortable with this option as they felt that it still let them have control, while also making the complex process less work. There are some issues with the legislation around the witnessing of forms, this could prove to be a barrier to this option being easily implemented. Taking these findings we were able to set a goal of what would be possible to achieve for a minimum viable product (MVP), that would support a better Rates Rebates service to be brought into the Alpha stage of testing. This Alpha service has been designed to make it easier for people to identify their eligibility and then apply for the rebate with less effort and stress. It was also designed to simplify service delivery for the council from the current very manual and paper heavy process to a simple, faster and digital service. In the Discovery, the collaborative team tested concepts with ratepayers showing different levels of proactive delivery. The majority of those we spoke to preferred the concept that had some proactive delivery, but had a process of consenting, to ensure that they retained control of the situation, rather than having the rebate automatically applied. This was an important factor in an MVP design, moving into the Alpha stage, for Rates Rebates. As it doesn’t assume a fully proactive delivery in order to meet user expectations of maintaining control throughout the process. We knew that we wanted to improve the service for people, and some constraints from the Rates Rebate Act meant we weren’t able to completely flip the process on its head. The Rates Rebate Act requires the applicant to submit a form, which is then signed and witnessed by an authorised person, usually a service centre staff member at the council when an application is submitted, similar to a statutory declaration. With this knowledge, and knowledge of digital best practice, we were able to set our goals for an MVP. We assembled a team of subject matter experts from the initial discovery team, and brought on developers to help make this digital service a reality. This includes Auckland Council, Tauranga City Council, Department of Internal Affairs, supported by the Service Innovation Lab team. Criteria for alpha to test - our scope Both Councils clearly articulated the need to address the signature/witness legislative barrier to enable a fully digital streamlined service and this has been addressed by DIA Legal advice. Through discussion, the Council then outlined the following specific areas where the proposed Alpha could create immediate value which would be used as success criteria for Alpha and beyond: An increase in uptake of the rebate and decreased time, effort and stress for users that use Alpha. A proportional drop in the refused applications, and we can measure web analytics of how many users roughly started the process and how many applications were completed. If Alpha involves only digital forms, then there would be a decrease in time and cost of processing payment from DIA, however, if the Alpha involves both paper and digital, this success criteria is not relevant to Alpha. Moving to a digital signature of a digital form, even if done in person, should dramatically reduce the resources and courier costs in administering this rebate for Councils, and should reduce effort for DIA. Through user research we will test current state against Alpha and should see an improved satisfaction level from ratepayers who use the services. Adding the collection of email address within the service would improve the ability to digitally deliver other services for Council. Additional success criteria after Alpha (would require integration with Tauranga City Council systems once Alpha proves successful) To reduce the manual processes for helpdesk filling in and doing data entry of the application forms should improve the speed of delivery at help desk, creating a small improvement both in the users experience and in help desk productivity. By simplifying and digitising the process, we hope to see an improvement in the turnaround time of batches sent to DIA and faster payments made to Council. Other desirable components for project to investigate Encourage consistency of messaging across councils and agencies for Rates Rebates. Help address user perceptions, that ‘the entitlement is being made purposely hard to prevent people getting it’, by making it easier to find, assess and apply for. Further research - diving deeper We dived even deeper into understanding the service delivery and what is possible. By examining legislation, technology systems used to run the current service, and modes of delivery we created detailed service blueprints of the current and future states, testing them against each other and our goals for the service improvement. We looked into how data was being submitted by ratepayers in their paper applications, and what forms this data took when digitised, transported, and processed. We looked over the form and worked on how the language could be improved for plain English, and how form fields could be made easier to complete. For example, when asking an applicant’s income, we could provide an option to press a button to state that they are receiving NZ Superannuation, rather than asking them what dollar amount that is, as we already know the figure limits for superannuation. Appendix One contains service blueprints that describe how the current service works, the alpha used in the Tauranga pilot and a potential future state of a fully automated proactive service future state. How the alpha works - user interface design Making it easy To make it easy we built a web application (web app) for the ratepayer applicants to use as the basis of the alpha. Applicants can learn if they were eligible for a Rates Rebate in the current year by entering their address. We created a widget where the applicant only types their address, which is auto-completed for them, and their Rates appear - it uses publicly available data which we obtained in collaboration with the Tauranga City Council. Once the applicant enters their income and number of dependants, they get an indication of their Rates Rebate. If they provide accurate information, they will get an accurate calculation - it’s all in one place, the user interface design guides people through the process giving them the information needed to help them make a decision whether its worthwhile for them to apply or not. If the applicant calculated they are eligible and chooses to apply, they are then presented with more information to ensure they understand the definitions of income and dependants. We were able to eliminate the need for paper in this process. Once an application is submitted online, the applicant then must visit the Tauranga City Council service centre, where they then make their statutory declaration on a touchscreen iPad using a stylus. The signature is saved and can be sent digitally to DIA. We could not avoid asking the applicant to travel to a city council service centre, because the legislation requires a witnessed declaration. The web application frontend was built in ReactJS, with a jsonapi.org server created with JSONAPI Suite on Ruby on Rails. Signatures were captured using “signature_pad” npm module. The web app was built in five weeks. All components used were open source, and available on github.com for other agencies to use. Eligibility calculator Our research told us people applying for the rates rebate often don’t know how much they earn. As many are on Superannuation or Work and Income benefits we can ask if they’re on one of these income sources, as the amounts are known. We also found that there was some embarrassment about income and about asking for any form of help which was a barrier to applying, so we designed an anonymous calculation step at the beginning of the service so people don’t have to go through a full application before they find out if they are eligible for anything (which is the current process). We found users that had gone through days of effort to apply, only to discover they were entitled to 30 cents. (Above: an example of the user journey when using the pilot digital application) User Interface/User Experience development The user interface, online eligibility calculator and web app went through testing with citizens, Tauranga City Council Service and Support Centre staff, as well as with DIA Rates Rebates staff throughout development. Testing with prototypes built in Atomic, a web based mockup tool, meant that we were able to make changes on the fly while testing and getting feedback. To read more on this prototyping and see some of the work in progress prototypes go to https://www.digital.govt.nz/blog/labplus-rates-rebates-prototyping/ Feedback on the prototypes was very positive. There were many iterations of language style used and testing helped us find language that we felt was appropriate, and read as the plainest English. Feedback from digital pilot users in Tauranga “I didn’t know government things could be like this” - User testing “I’m partially blind, so if things are on a computer I can zoom in and read them” - First applicant on Tauranga pilot “That was easy, wasn’t it!” - Pilot applicant “I would do it online next time” - Pilot applicant “That was easier than I thought!” - Pilot applicant Opportunities for digitising the application By making the application digital we were able to show where improvements could be made to the system and processes of the service. There are opportunities for integration with Rating Information Databases from local councils, local council information management systems, as well as central government systems. Other benefits of a digital service are that changes to the entitlement can be implemented in a shorter period of time, such as the income threshold and maximum entitlement, which are reviewed every year and often changed. Investing in a creating a digital application channel and changing legislation to remove the need for a statutory declaration would mean a lower cost of implementation to citizens, councils, and central government (ie DIA, IRD and MSD) due to reduced processing times and cost of printing and moving paper forms. The application process was entirely digital3 and removed the need for paper, as well as considerably reducing the time for customers and processing time for Councils. The estimated time for an applicant to complete the paper form is 25 minutes, with the digital application taking roughly 4 minutes4. Councils also found this reduced time of processing, as they could copy and paste applicant information into their systems instead of typing out by hand, as well as time saved from applications being unable to be submitted with gaps or incomplete sections in the digital form, which is common for paper forms. Appendix 3 shows a physical comparison of the web app vs the current paper application. Insights from discovery and alpha Applicants insights Customer segmentation The majority of current applicants are retired, around 80% of applicants receive New Zealand Superannuation. There is a misconception that Rates Rebates require you to be on NZ Superannuation to be eligible. Supported Living payment recipients and solo parents are another significant demographic of applicants, although more research is needed to confirm demographics due to the lack of information collected on applicants. Lack of awareness We believe that there are many ratepayers who are eligible but do not know about the entitlement. Council rebates and contact centre staff are worried that there are a lot of people out there that need a rebate, but do not know about it. Our research showed that many people find out about the entitlement via word of mouth. – almost by accident, rather than from direct messaging from Local or Central Government. Examples from our research include one ratepayer who had experienced a change in their financial situation after being diagnosed with a serious illness, who was informed about the entitlement from a friend who had learnt about Rates Rebates from the doctor. When rates are not paid, this is a trigger for the Council to proactively reach out to applicants about applying for a rebate. This can often be the way a ratepayer finds out that Rates Rebates exist and that they are entitled to one. Complexity Customers do not find completing the application easy or enjoyable. Collating their information and obtaining evidence from other agencies have been identified as a pain point. It was often said that you have to know the system to get the entitlement, and the application is quite difficult and complex. Comments from citizens interviewed include: “Doesn’t the government know all this stuff about me anyway?” “If this is what I have to do to get some money do I really want to do it?” “People won’t take the money if the value of the trade is too low” [e.g. time, giving up their personal information] Accessibility Both council staff and ratepayers commented that at peak application time, the service centres become very busy with rebate applicants and described scenes where the lines were long, with many in the lines being elderly and council staff bringing out chairs for those who struggle to stand for too long. Some said it “feels like a hospital waiting room” and others worry about how they will complete their Rates Rebates applications when they are older and less able-bodied and/or able-minded. The requirement and logistics of needing to have the application witnessed is a big pain point - especially for those with low mobility. There is also a user perception that there needs to be options for service delivery other than Digital - “What if they don’t have a computer?” Applicants asked: “Why can’t you just do it over the phone?” Cultural expectations A common perception from successful applicants was that there are a lot of people worse off than them who are more deserving to get a rebate. Some applicants expressed that rebates made them feel as if they begging for money now that their main source of income was NZ Superannuation. Quotes from applicants interviewed include: “If I’m entitled to something just give it to me” “It felt like a cross-examination” “It feels like airing your underwear” Since becoming a Superannuitant “I am a second class citizen” “It’s embarrassing having to ask [for a rebate] but you are entitled” Trust in digital and government A single poor experience with computers or automated systems can colour how much trust a customer has around automation. Many ratepayers we interviewed mentioned either themselves or someone they know who’d had a bad experience such as either being scammed or having had a poor customer experience with a company with an online component. Customers often find correspondence from government threatening when it’s addressed to them as an individual. This can lead to communications about entitlements either being missed or misunderstood, as citizens feel that they will not be contacted by the government unless there is a problem. System and process insights Inefficient process The process is very manual and involves costly double handling. Applicants must fill in the same information and apply every year even when their information does not change. Applicants often submit incomplete and incorrect forms which compounds problems further. Ratepayers find the application confusing, leading to forms often completed wrongly , or required fields left blank. If this happens, the applicant must be contacted and then the application re-submitted, delaying when the rebate can be granted which is often at a time when it’s needed most. This results in more double handling. Cost to council Councils can be left waiting for DIA payments to come through after they have discounted customers rates. Many councils are also unhappy with the cost of implementing the facilitating and checking of an entitlement application which cost them staff that could be better used in more high value contacts with their ratepayers. Peak times are hard to staff and manage The majority of applications come at the start of the rating year in August. Due to the number of applications, compared to other months of the year, councils often hire temporary staff for a number of months to help process rebate forms, and DIA have similar issues related to staffing (ie staff are moved from other areas to help out) during this busy period. Service centre support and success of applications Council representatives are an important part of the process and are seen as visible evidence that something is being done to progress their application. For some customers, Council representatives make it worry free and take the stress out of it. Councils often receive thank you cards and calls from customers who have gotten a rebate. The council representatives knowledge and willingness to help make the difference to the experience and success of applications. If there wasn’t this level of assistance, then it is less likely to be a positive experience. But this great customer experience comes at a cost for work that is considered low value compared to more complex ratepayer queries. “Wouldn’t it be great to not need a 50 page handbook” Council staff on understanding Rates Rebate Act (1973) and DIA rules Inconsistent messaging from councils There are inconsistencies across councils on implementation, e.g. when applicants are asked to provide proof, and what information that they give to customers. We mapped information provided on council websites about Rates Rebates and found a large variation in amount and types of information to inform ratepayers about rebates. Prescriptive legislation The legislation is very prescriptive, making it impossible to create an end-to-end digital service. This is impacting the customer experience. The requirement for a statutory declaration has been identified as a key issue. Next Steps Both the discovery and the alpha identified that there is desirability to progress the alpha service to full production from both an applicant and local councils perspective and the Lab is currently supporting DIA to explore how to transition the alpha to a Beta. A beta is developing a service to meet demands of a live environment, including understanding how to build and scale the service while continuously meeting user needs. This transition work involves understanding the viability of the service from a business owner perspective (ie development, implementation and ongoing costs) and the feasibility from a technology perspective of implementing the alpha into production. The goal being to identify a range of options that could be applied to deliver a production version of the service for DIA leadership consideration. Next steps will consist of: a workshop to explore the collective goals we have for the service and initial options that could be explored in more detail post workshop Detailed exploration of the initial options and identification of other if appropriate Recommendation and decision by DIA to stop or commit to a roadmap for delivery that could include engaging with more Councils, more user testing and research, more development or full development. DIA as custodian of the Rates Rebates will ultimately make a decision based on the work done and their own priorities on whether or not to continue the development to full production. The New Zealand Society of Local Government Managers (SOLGM) has made a submission for the Local Government Regulatory Systems Amendment Bill, to better support online applications for rates rebate by removing the requirement for an officer of the council (or anyone) to witness the statutory declaration. This would make the implementation of a truly online application process possible. The alpha identified in practice how the statutory declaration is out of step with digital service delivery. This issue is being referred to the required Policy teams to investigate if statutory declarations could be replaced for other services as well as the Rates Rebates. Recommendations if approved to production If the alpha is developed further to production we recommend exploring these areas for service improvements: Work with Inland Revenue and Ministry of Social Development to allow for consented income testing to make it easier for applicants to prove their income. Work with other agencies such as Ministry of Social Development to integrate the rates rebate application into applications for other services, such as applying for Jobseekers, Supported Living, NZ Superannuation etc. Consistent messaging across agencies - After discovering the inconsistent messages about rebates across councils and agencies, there is potential for work to improve consistency across councils on messaging regarding Rates Rebates. We mapped the information across councils with large variations found: https://docs.google.com/spreadsheets/d/1uHktpWj03FKFX0F0Hn7GK9pg1sMxBKaaPfjA8Gd_ra8/edit#gid=0 Potential for greater link with Superannuation - A large portion of rebate receivers are retired and on superannuation. There is potential to use this as a vehicle to help either gain awareness of the entitlement and/or to use this to make application easier. Many councils do not verify income if the applicant is on super, as many on super do not know their gross income and are on the same amount. Engage more user groups - On testing, we suggest more engagement with a range of user groups who require additional relationship building then the short time that the sprint process allowed. It would also benefit system improvement to invest in understanding cultural attitudes around receiving money/help to improve uptake of the entitlement. This came up in research as an issue, but due to limited timeframes and scope was not able to be investigated deeper. Translation to other languages - Councils identified that they had applicants who had low levels of fluency in English and found applying difficult. It was common for the council teams to find a workmate who spoke the language deal with these applications, and also for these staff to move on leaving the teams unable to deal with applicants with low English. Having a digital application would allow for pages to translated and easily switched to languages such as Samoan, Hindi and Mandarin. Appendix One - Service Blueprints DIA Rates rebates completed forms processing: Current state This blueprint helped us to see where manual handling was in place once forms were sent to DIA, and where opportunities for cost/time saving through digitisation could be found. Rates rebates Alpha Blueprint This blueprint shows how the Rates Rebates pilot in Tauranga service structured, and helps show what needed to be built and what existing systems could be used without changes required. Future State Blueprint This blueprint shows a potential future where information sharing between agencies is used to provide proactive delivery of the rebates entitlement. Appendix Two - Trends analysis The following charts describe the number of claims made for the last three years and the timings of when the applications are made to the Councils. The majority of applications are made in August each year and to mitigate the high workload on existing council staff, temporary staff are brought in to help process these. DIA audit these applications and their busy time falls between Aug and Oct when they verify the claims. Reasons why claims are refused and cancelled include: The applicant earned more income than The application was incorrectly completed The applicant didn’t live at the location advised The applicant had an undeclared partner There is anecdotal evidence from this study most are due to misunderstandings of the form and the application process. Dropping number of rebates claimed each year The number of Rates Rebates claimed each year has been dropping. This is a well known trend and is mostly due to the income threshold not keeping in pace with the rise in superannuation payments year to year, leading to those on the couples super especially, gradually dropping out of eligibility. There are some other factors that are potentially affecting this, including rates of homeownership and other factors. Home Ownership rates lowest in 66 years In 2017 homeownership rates in New Zealand were at the lowest they had been for 66 years at 63.2 percent of people today live in a home they owned, the lowest rate of ownership since the 1951 Census with rates recorded at 61.2 percent5. Awareness of Rates Rebates There is anecdotal evidence that suggests that awareness of the entitlement is low. Due to current measurement practices we don’t know how many people are eligible and what are the reasons that they don’t apply (eg they choose not to, the application process is seen as complicated and confusing). The later point is consistent problem with most government services or any services for that matter - why does someone not use your service? To answer this question for Rates Rebates would require data analysis and user research. Cost of housing increasing Stats NZ data shows an upwards trend in the cost of housing since 2007. There has been an 8.0 percent increase in the weekly cost of housing from 2014/2014 to 2015/2016. Stats NZ say that this increase was mostly due to households spending more on mortgage payments (up 12.8 percent) and property rates (up 9.6 percent). In comparison, renting costs over the same period increased by 1.8 percent6. New Zealand’s access to the internet Internet NZ reports that approximately connection7. This has an impact on people’s ability to find out about their entitlements with most service providers moving to digital channels. It also put more emphasis on designing for mobile as this will be the preferred channel that people will access internet in the future. Continuing development of the rates rebate alpha will need to keep in mind both of these points. Appendix Three - Comparison between the web app and current paper application Here is a physical comparison of the web app vs the current paper application. The length of the web app process The current 4 page paper form The maximum subsidy amount is reviewed yearly - for 2016/17 the maximum was $610. In 2017/18 the maximum is $620. In 2018/19 its $630. ↩ Based on Treasury CBAx Cost Benefit Analysis calculator ↩ There was still a need for the applicant to come into the Council office to sign and get their application witnessed however this was also done digitally - no paper needed. ↩ This does not take into account the time and effort to go into the Council office and sign the digitally Understanding how long that this could take depends on each applicant’s circumstances. ↩ Home ownership rates lowest in 66 years according to Statistics NZ - New Zealand Herald https://www.nzherald.co.nz/business/news/article.cfm?c_id=3&objectid=11779664 ↩ Household expenditure statistics: Year ended June 2016 – corrected, Stats NZ https://www.stats.govt.nz/information-releases/household-expenditure-statistics-year-ended-june-2016 ↩ State of the Internet 2017 Report- Internet NZ ↩"},{"title":"ACC Better Rules Collaboration report summary","url":"/2019/07/01/ACC-Better-Rules-Collaboration/","tags":["better rules"],"body":"Exploring Machine Consumable Code - ACC Introduction Supported by the Accident Compensation Corporation (‘ACC’), the Ministry of Business, Innovation and Employment (‘MBIE’) is exploring ways to modernise the Accident Compensation Act 2001 (‘the AC Act’). This includes exploring a structural rewrite to provide a modern and responsive piece of legislation that supports effective and efficient delivery of the accident compensation scheme. While exploring opportunities to make the AC Act more accessible and fit for purpose from a structural rewrite, MBIE and ACC learned about ‘machine consumable’ legislation, and the work of the ‘better rules – better outcomes’ (‘Better Rules’) initiative and the Service Innovation Lab. Machine consumable legislation means that its rules can be presented in a structured format (code) that can be processed by a machine (computer) without human intervention. It recognises that machines are ubiquitous, services are increasingly consumed digitally, and there are many uses for machine consumable legislation that are only beginning to be explored. The Better Rules initiative is examining ways to support this through the way New Zealand regulation is developed and implemented, and the Service Innovation Lab previously facilitated a similar experiment. Approach The cross-agency and multidisciplinary Accident Compensation Better Rules Discovery Team (‘the team’) undertook a ‘discovery’ (experiment) over six weeks of half-days based at the Service Innovation Lab starting March 2019. The team comprised legal, policy, legal drafting, business rules, operational, and software development experts from ACC, MBIE, the Parliamentary Counsel Office, the Department of Internal Affairs (‘Internal Affairs’), the Inland Revenue Department (‘Inland Revenue’), and the Service Innovation Lab. The discovery aimed to develop a blueprint of rules for entitlements in the AC Act by developing concept models, decision models, rules statements, and code. The discovery was to support a potential structural rewrite of the AC Act through: creating a shared understanding of the rules for entitlements; exploring use of machines to identify gaps in logic of the rules; providing a practical example that shows how this approach can be applied; and developing tools and techniques that could be applied to future work. The team recognised that it was unrealistic to complete this blueprint for all entitlements in this time, and developed a prioritised list of entitlements to work through. Key findings Rules statements are of significant value for legal drafters: Rules statements – a simple set of rules synthesised from complex legislation – that have been robustly developed and tested are expected to assist the Parliamentary Counsel Office (legal drafters) to undertake a more comprehensive and accurate rewrite that is more human and machine consumable. Developing rules statements identified gaps: The process of developing rules statements identified gaps in the logic of legislation that had not been previously identified, which range from technical gaps that could be resolved by legal drafters through to gaps that require further analysis. By resolving these logic gaps, legislation can be more human and machine consumable, the risk of misinterpretation can be reduced, and what is implemented can better match policy intent. Legislation may have longer rules and more of them: A prevailing view in the team at the beginning of the discovery was that a structural rewrite would result in fewer or shorter rules to make the AC Act more accessible and human consumable. To the contrary, the team found that ensuring there are no gaps in the rule logic can result in longer rules. However, these longer rules were clearer and would ensure legislation is more human and machine consumable. Furthermore, as legislation becomes machine consumable, and policy developers have tools to better understand and model its (positive and negative) effects, additional rules may be created to create more nuanced policy. Developing rules statements and code at the same time most effective: The discovery initially explored handing rules statements to software developers for turning into code. However, it was found that writing code at the same time as rules statements produced better quality rules statements and code, and was more efficient. It improved shared understanding, reduced follow up questions, and allowed the code to validate the rules statements. Concept models improved shared understanding: The use of concept models as the first step for any new topic improved shared understanding and team engagement. They showed not only what was in scope but also what was out and enabled focused and effective communication. Concept models proved to be a core first step for the multi-disciplinary team to start working on each entitlement. A small multidisciplinary team can produce most outputs: While the discovery had a broader team to draw on (and who were all used), the outputs that would support a structural rewrite were produced with a small team (fewer than six) of experts across business rules, operations, policy, legal, legal drafters, and software development. Tools increased efficiency and broadened use of code: During the discovery, the team identified areas where different tools may have been of value, including tools for capturing concept models, tools that can test policy, and tools for storing rules in a dataset form from which executable legislation as code could be derived. The team experimented with tools and found that they demonstrated value and (at least in one case) were complementary to each other, but neither is necessary for a structural rewrite alone. Rules requiring human judgement can be written in code: The team explored developing code for an area of legislation requiring significant human judgement to test whether it is difficult to code, and found it was no different or more complex than other rules. It emerged that identifying these types of rules could be used to track the quantity of human judgement within a piece of legislation, which could provide a new perspective and way to measure how much a piece of legislation introduces. Value of software developers is beyond code: The software developers brought a lot of value to the multi-disciplinary team that was beyond the code they create. They looked at rules and logic on behalf of the machine, and improved the logic and robustness of rules statements. A multidisciplinary team improves implementation: Using a multidisciplinary team to develop rules statements improved connections of people involved in policy development through to those in operations, and was observed to reduce translation gaps and is expected to improve implementation. It also sped up the cadence of work as the experts were in the room at the right time, eliminating handover errors and delays that usually occur when experts from a different team provide input. Opportunities Develop rules statements for other parts of the AC Act: To support legal drafters to ensure a structural rewrite would result in more human and machine consumable legislation, MBIE and ACC should develop rules statements for all provisions in the AC Act that may benefit from this work. A pragmatic approach would be to develop a prioritised list of provisions that would benefit most from rules statements, and scope the effort (time and resources) to complete that work in the time available. This does not require another intensive discovery, but rather could use regular discrete blocks of time (eg, 4 hours per week over six months). To develop code that tests the logic, a software developer is required. Use methods from the discovery for other policy and legislative changes: While the focus has been on a structural rewrite, the approach tested across the six-week discovery could also be used as part of everyday business when considering policy and legislative changes. While this is particularly true for the AC Act, which is complex and composed of many interrelated provisions, considering different policy and legislative proposals against rules statements and code would robustly test their logic and implications. Improve macro view through concept models: MBIE and ACC should seek opportunities to improve the macro view of accident compensation scheme settings through concept models. This could give a transparent and consistent view of the accident compensation scheme, and provide a common foundation for cross-agency collaboration, in the same way the smaller and more targeted concept models did for the discovery. Code the whole AC Act and make it public: To fully support the long-term ambition of machine consumable legislation in New Zealand, ACC, MBIE, the Better Rules initiative, and the Service Innovation Lab could explore coding the whole AC Act. Much of the AC Act would have been coded as part of the process of creating the rules statements. A key realisation of the potential of machine consumable legislation is publicly publishing the code in an executable form for the same reasoning governments publish their legislative text: to aid people’s comprehension of the law. Coding the AC Act would be dependent on the Better Rules initiative completing its planned work on developing New Zealand standards and architecture for machine consumable legislation. Continue to explore using code already developed: Some code has already been developed as part of the process to develop rules statements (and more would be developed if the rules statements are developed). This code presents a unique opportunity for innovation. For example, it could be used for policy development (eg, modelling test cases), for consumers or advocates to develop an end-user interface, or for government to see how the accident compensation legislation interacts with other legislation. Working with the Better Rules initiative and the Service Innovation Lab, ACC and MBIE should continue to explore this so that the opportunity is not wasted. NOTE The full report about this discovery is available as a PDF; however we are currently working on an accessible version of this for future release. As always we would like to know your thoughts and comments about the Better Rules work so please make contact with us."},{"title":"Testing our Toolkit","url":"/2019/07/31/Testing-Our-Toolkit/","tags":["open source","tech"],"body":"Tests we run This toolkit is built using an open-source tool called Jekyll. We write content in markdown format, which is then parsed by Jekyll which produces a static HTML website that we host on Github pages. Content and other changes are proposed by team members using the pull requests on Github. There are a bunch of automated tests the proposed change must satisfy to be accepted (as well as manual testing). The automated tests are fast and means the pull request is in good shape by the time a team member begins their peer review. The tests catch many of our mistakes, as well as being an easy way to learn about content standards. Our Tests We use a continuous integration service called CircleCI to run our tests. CircleCI is an open-source tool and is available to us for free because our projects are also Open Source (as per NZGOAL). yamllint YAML is a standard format for configuration files (and also the name of Brenda’s cat). Jekyll uses YAML, so we use a linter to inspect our files. yamllint is a python tool available on pip. It catches any strange/incorrect indenting with better and more helpful errors messages than the tool that reads those YAML. build CI builds the static content on every pull request to ensure that once your change it merged into mainline (the dev branch) it can be successfully built for deployment markdownlint markdownlint is a linter that checks you have followed our style guide for markdown files. The linter catches when you’re using bold instead of headers. It fails your pull request if you don’t put descriptions on images if it’s not clear which are the header cells on a table, and if your header nesting doesn’t make sense in a tree structure. percy Percy is a service that takes screenshots of every page and compares them to the previous screenshot. If there are differences (i.e. you’ve modified a page on the toolkit) you’ll need to go to Percy and then view and approve the changes. If you’ve broken the display on a page, you’ll see it in the screenshots (and of course if you’ve broken a page, don’t approve it!) accessibility The accessibility check uses a tool called pa11y-ci to check we adhere to WCAG21 standard. The New Zealand Government - Web Accessibility Standard 1.1 is based on WCAG21. This linter is configured by a file named .pa11yci.json. Conclusions Automated tests catch common mistakes quickly, and more thoroughly than our manual testing. A linter can give quick feedback on proposed changes before the author asks another team member for their peer review. With automated content testing, we can get better quality markup on our toolkit pages, and with a quicker publishing turnaround. On a pull request the checks look like this:"},{"title":"About","url":"/about/","tags":[],"body":"Purpose We are an all-of-government lab, within the Aotearoa New Zealand government, focused on cross agency design and development to experiment, drive and enable the systemic change of government to improve people’s experiences when they interact with government. Goals We do the tricky technical work to make it easy for you. We have been setup to: Grow the ecosystem of services built with government components Reduce barriers to building better digital services Accelerate development of life event services Change perceptions of government being slow and behind with technology Enable a culture of experimentation and adaptiveness Provide a neutral place not linked to a specific agency, product or service in order to provide an outside-in ‘joined up’ view of government services. Work Programme The Service Innovation Work Programme outlines what we do. It comprises initiatives that usually fall outside the remit, capability or budget of a single agency. These initiatives are prioritised by the Service Innovation Reference Group and fall into the following streams: Integrated services - Delivering joined-up government services (agencies, NGOs, private sector) where it makes sense. Digital transactions - Maintaining the momentum of moving to digital channels and supporting life event initiatives. Proactive delivery - Delivering entitlements to customers without them having to apply. Information sharing - Allowing consent-based personal information sharing. Digital Identity - Supporting customer online identity. All the initiatives we work on are service delivery focused. They either help people interact with government directly or indirectly by improving the behind the scenes processes and infrastructure to enable a better experience for those who deliver them and receive them. This indirect work is part of our goal of opening up government services and data so it can be reused safely by other parts of local and central government but private sector and NGO service providers. We call this Government as a Platform. Basically it’s about ensuring people’s government experiences are easy, equitable and empathetic. Whether directly or through their own trusted channel or service provider. The Service Innovation Lab 2017-18 FY Work Program Report Approach We are an interdisciplinary team with backgrounds in agile, design, policy and technology. We use evidence based decision making and design thinking to transform government service experiences. We work in the open to prevent problem shifting and duplication and increase the sharing, reuse and adaptation of tools and approaches. By partnering with other agencies, not for profits, private organisations and other governments we can understand the whole service system to identify and test the best ways to create lasting change. While we have a digital focus we ensure people’s needs are considered first as we collaboratively work on creating customer centric services regardless of agency channel preferences. Our approach aims to reduce risk and increase the impact of innovation across government and do this through delivery. There are two ways to work with us - in partnership with the lab team to help deliver the work programme or by using the collaborative and workshop spaces. History In 2012 Better Public Services (BPS) initiative was formed with 10 focus areas for government. One of these, known as Result 10, aimed to improve interaction with government. Research uncovered many pain points for people when accessing government services, especially where they needed to interact with multiple government agencies. For example: when applying for financial support related to a significant life event such as having a baby. Poorly integrated digital services were pushing customers back to non-digital channels this became the driver of our approach and work. In 2013 the Digital Service Council (DSC), comprising eight agencies, was established to provide governance to this programme. In 2014 priority was given to integrated services associated with life events. To support this strategy a Partnership Framework was established with the ICT Senior Leadership Group (ICT SLG) of agency Chief Executives (CEs) and the Service Innovation Working Group (SIWG) comprising service delivery Deputy Chief Executives (DCE’s). DSC also agreed for agencies to develop a federated model of service delivery to reduce customer effort and deliver efficiencies for agencies. November 2015 a Service Innovation Reference Group (SIRG) was established to provide support to SIWG by detailing of the work programme and initiatives. February 2016 The Service Innovation Lab (the Lab) was founded with support from the Service Innovation Work Programme Team from Internal Affairs, Assurity Consulting Ltd and direction from the SIRG. Secretariat and management overview is provided by Internal Affairs, which is the Government’s functional lead agency for digital development. Internal Affairs’ chief Executive is the Government Chief Digital Officer (GCDO) and the agency is one of several belonging to the Government Digital Partnership group. Today the lab is working with multiple agencies on delivering initatives associated with the Service Innovation work programme and GCDO work programme."},{"title":"Brenda Wallace","url":"/author/brenda-wallace/","tags":[],"body":""},{"title":"Charlotte Hinton","url":"/author/charlotte-hinton/","tags":[],"body":""},{"title":"Deshan Gamage","url":"/author/deshan-gamage/","tags":[],"body":""},{"title":"Felipe Bohorquez Perry","url":"/author/felipe-bohorquez-perry/","tags":[],"body":""},{"title":"Glen Thurston","url":"/author/glen-thurston/","tags":[],"body":""},{"title":"Grant Carpenter","url":"/author/grant-carpenter/","tags":[],"body":""},{"title":"Jacob Ong","url":"/author/jacob-ong/","tags":[],"body":""},{"title":"Karyn Brice","url":"/author/karyn-brice/","tags":[],"body":""},{"title":"Mahkaila Jones","url":"/author/mahkaila-jones/","tags":[],"body":""},{"title":"Matthew Mccallum","url":"/author/matthew-mccallum/","tags":[],"body":""},{"title":"Matti Schneider","url":"/author/matti-schneider/","tags":[],"body":""},{"title":"Meredith Odea","url":"/author/meredith-odea/","tags":[],"body":""},{"title":"Nadia Webster","url":"/author/nadia-webster/","tags":[],"body":""},{"title":"Pia Andrews","url":"/author/pia-andrews/","tags":[],"body":""},{"title":"Rob Holmes","url":"/author/rob-holmes/","tags":[],"body":""},{"title":"Siobhan Mccarthy","url":"/author/siobhan-mccarthy/","tags":[],"body":""},{"title":"APIs for Service Innovation","url":"/projects/api-for-service-innovation/","tags":["API"],"body":""},{"title":"Component Library","url":"/projects/component-library/","tags":["Component Library"],"body":""},{"title":"Family Services Directory API","url":"/projects/msd-family-services-directory-api/","tags":["Family Services Directory API"],"body":""},{"title":"Open Fisca Aotearoa","url":"/projects/open-fisca-aotearoa/","tags":["Open Fisca"],"body":""},{"title":"RapuTure","url":"/projects/rapuTure/","tags":["RapuTure"],"body":""},{"title":"Consent Based Data Sharing","url":"/projects/consent-based-sharing/","tags":["Sharing"],"body":""},{"title":"Digital Nations","url":"/projects/digital-nations/","tags":["Digital Nations"],"body":""},{"title":"Entering Tertiary Life Event","url":"/projects/entering-tertiary-life-event/","tags":["Tertiary Life Event"],"body":"To better understand the tertiary education landscape, the Tertiary Education Commission (TEC) and the Lab completed a research discovery to identify two things: what people found challenging, and what opportunities lay in the experience of entering or re-entering the tertiary education system. The tertiary education system assumes that learning is a linear path when in fact change and interruption are natural and will occur, especially for the youngest students. Together with TEC, we found several challenges people face who when entering tertiary education These include the quality and relevance of the information, the process they follow, and where they are in their life. The final output of the discovery was a research report and it recommends a number of opportunities for the education sector to explore further. Approach and findings During the prediscovery exercise we focused on the needs of the consumer and the information and services they access. We interviewed and workshopped alongside 55 students and subject matter experts, and reviewed a wealth of research material. We looked at opportunities where things could be done differently. We focused on four areas specific to the needs of someone wanting to enter tertiary education. We looked at what might add value for both students and their supporters and influencers. We have an opportunity to learn from and design for what are typical changes during our lives. “What do I need to know and understand to help me make the best choice for now and for my future?” Students and their supporters (family, peers, teachers etc) need to plan and decide their pathway into tertiary education. Not only what suits their present life but also their future aspirations. Information relevant to the students’ life, aspirations, personalities, and how different study options affect life outcomes will aid this process. “What and when do I need to share information about myself, and what I want to do, with others?” Students need to provide the right information, from the right place at the right time. To increase efficiency and lessen unnecessary effort we can remove duplicate requests for existing information. Providing timely and actionable information about key choices and events will also help create certainty for students and their supporters so they don’t miss opportunities. “Change is normal, and should be easy”. A typical student’s circumstances change all the time. It means a change in the course of study is highly likely. It happens more often for first-time students and those transitioning from secondary school to tertiary education. Despite this, changing courses often results in significant personal and financial consequences for the student. We could recognise that change is normal and natural and assist students through these changes. “Feeling included and supported is key to better outcomes.” Students who feel included and supported typically achieve better during study and after. There is an opportunity to raise and recognise students feelings of connectedness, acceptance, safety, and recognition of their abilities. We could also adapt teaching styles and mediums that help students and their supporters make the best study choices. What was the research used for TEC used the research for: the Careers System Strategy Ministry of Education’s refresh of the Tertiary Education Strategy (TES) for 2020 informing their existing and future operating policy and strategy with regards to investment and delivery in tertiary education help them provide meaningful careers advisory services for New Zealanders."},{"title":"Legislation as Code","url":"/projects/legislation-as-code/","tags":["Legislation as Code"],"body":"Work to date Our rules can be viewed at https://rules.nz Birth of a Child (or welcoming a child into your whanau) Encoding entitlements related to the birth of a child (or welcoming a child into your whanau) into re-usable open legislation as code. This component was then used within Smart Start - financial help. Child related entitlements encoded Social Security Act 2018 Accommodation Supplement Childcare Subsidy Child Disability Allowance Community Services Card Home Help Job Seeker Support Orphan’s Benefit Sole Parent Support Supported Living Payment Unsupported Child Young Parent Payment New Zealand Superannuation and Retirement Income Act 2001 Superannuation Income Tax Act 2007 Working for Families (various) Best Start Parental Leave and Employment Protection Act 1987 Paid Parental Leave Citizenship by Grant A complex formula from within the Citizenship Act, used to calculate if an applicant has been in the country enough days to satisfy a clause. This was encoded into a rules engine called OpenFisca, along with some related sections of Immigration Act. Accident Compensation With ACC and MBIE we explored the entitlement clauses in the Accident Compensation Act to see where descretion is applied, then looked to see how these could be encoded. The sections related to Loss of Potential Earnings, and Rehabilitation were encoded into Open Fisca. Media Conference talk at Pycon 2019 in Sydney Australia Brenda Wallace describes Legislation as code."},{"title":"Notice of Sale","url":"/projects/notice-of-sale/","tags":["Notice of Sale"],"body":""},{"title":"Optimistic Futures","url":"/projects/optimistic-futures/","tags":["Optimistic Futures"],"body":""},{"title":"Rates Rebate","url":"/projects/rates-rebate/","tags":["Rates Rebate"],"body":""},{"title":"Renting a Property","url":"/projects/renting-a-property/","tags":["Renting a Property"],"body":""},{"title":"SmartStart","url":"/projects/smartStart/","tags":["SmartStart"],"body":"The Lab helped the SmartStart team with the incorporation of new features such as ‘Services Near Me’ and ‘Financial Help’"},{"title":"Victim of Crime Life Event","url":"/projects/victim-of-crime-life-event/","tags":["Victim of Crime"],"body":""},{"title":"SIL UI style guide","url":"/styleguide/","tags":[],"body":"This is the user interface (UI) style guide for The Service Innovation Lab The site uses a custom set of styles that inherit from the SIL brand guidelines to create style that is professional, unique, and informative. The guide has a two-fold purpose: Speed up onboarding of future maintainers of the site. While most of this guide addresses content needs, there is some technical documentation for how we have extended Jekyll’s out-of-the-box functionality. Serve as a living reference for SIL brand of styles. Adding a blog post If you are updating or adding a new blog post, go to Layouts to get started, or go directly to Blog components to learn more about enriching your blog post. Adding a project page If you are updating or adding a new project page, go to Layouts to get started. Overriding the Design System While te SIL relies heavily on the NZ Government designs/styles, there are several instances where we have overridden styles with our own set of custom stylesheets. This is primarily to align ourselves more directly with the SIL brand set of fonts, colors, and logos. Additional overrides were made to create custom layouts or components to address user needs that are specific to the marketing of the SIL brand. Explore style guide"},{"title":"SIL UI style guide","url":"/styleguide/components/","tags":[],"body":"Buttons Breadcrumbs The site breadcrumb can be used to establish a sense of place within the site. It is only included in the primary layout by default, but can be added to any layout or custom page as needed. Project cards The card component is used as a preview for project pages, but could be adapted to meet additional needs if necessary. Sticky subnavigation The sticky subnavigation is a pattern that is used frequently throughout the site to make larger bodies of content easier to navigate. The About page is good example of the sticky subnavigation in the live site. What is sticky subnavigation A secondary navigation field that exists on the left side of a page, adjacent to a corresponding field of content. It is “sticky”, which means that its position isn’t absolute or static, but is both, depending on the user’s location on the page. It provides a sense of location by updating the active section of content that the user is viewing. Testimonials and fun facts Testimonials and fun facts are used throughout the site to highlight the impact SIL has made with our partner agencies. You can find the styling used on the home page, how we work, and various project pages."},{"title":"SIL UI style guide","url":"/styleguide/for-developers/","tags":[],"body":"The Service Innovation Lab use Jekyll to build static, maintainable websites. One of the core features of Jekyll is the Liquid templating language, which has a series of filters and tags that allow developers programmatically generate content. Jekyll and Liquid do quite a bit, but sometimes they aren’t enough for a project’s specific needs. When the built-in functionality that Jekyll provides isn’t enough, it is possible to build or borrow plugins to extend Jekyll. Plugin gems SIL is using several Ruby gems plugins: Plugin gem Description jekyll-archives creates and manages blog-related pages. jekyll-feed generates an Atom (RSS-like) feed at /feed.xml. jekyll-paginate allows for pagination of blog pages, or pages with long lists of items. jekyll-redirect-from enables redirecting from pages that are no longer active. jekyll-seo-tag adds metadata tags for search engines and social networks. jekyll-sitemap generates a sitemap at /sitemap.xml. This makes it easier for search engines to find us. jekyll_frontmatter_tests tests to see if the correct front matter (meta data) is present on pages throughout our website. jekyll_pages_api generates a JSON file at /api/v1/pages.json that serves as the base for a site search engine. jekyll_pages_api_search search engine that uses jekyll_pages_api jekyll_oembed creates a Liquid tag that uses OEmbed Custom plugins SIL uses many custom plugins for more specific site needs: Custom plugin name Description author.rb creates two filters, lookup and team_link. author_data.rb Creates an API for using data pertaining to authors throughout the site. update_author_data.rb Uses the AuthorData API to update the list of published authors. This will happen automatically every time the site builds. embed.rb legacy filter for embedding content within the site. The current approach is to use an OEmbed plugin. liquify.rb liquid parser. markdown.rb markdown parser. matching_posts.rb creates a match_posts filter that creates a list of posts belonging to a specific author. team.rb creates a team_photo filter that matches an author to their provided team photo. More documentation. utility.rb A list of Liquid filters that can be used for a variety of purposes: clip_char, hash_link, matches_url, debug, find_collection, where_obj, in_groups, and weighted_sort."}]}